Gloryfy/NFC/NfcdlibEx1_BasicDiscLoop_s32k118/NxpNfcRdLib/intfs/phhalHw_Ncx3330_Reg.h
/*
*         Copyright (c), NXP Semiconductors
*
*                     (C)NXP Semiconductors
*       All rights are reserved. Reproduction in whole or in part is
*      prohibited without the written consent of the copyright owner.
*  NXP reserves the right to make changes without notice at any time.
* NXP makes no warranty, expressed, implied or statutory, including but
* not limited to any implied warranty of merchantability or fitness for any
*particular purpose, or that the use will not infringe any third party patent,
* copyright or trademark. NXP must not be liable for any loss or damage
*                          arising from its use.
*/

/** \file
* NCx3330 Register map.
** $Author:nxp62726 $
* $Revision$ (v05.22.00)
* $Date$
*/
#ifndef PHHALHW_NCx3330_REG_H
#define PHHALHW_NCx3330_REG_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */


#define MASK_TX_LASTBITS                                                                                 0x07U    /**< The bits that are valid for TX_LATS_BITS field */
#define MASK_RX_LASTBITS                                                                                 0x07U    /**< The bits that are valid for RX_LATS_BITS field */
#define MASK_RXWAIT                                                                                      0xFFFFFU/**< Bitmask for RxWait bits. */

#define SYSTEM_CONFIG                                                                                    0x00U
#define SYSTEM_CONFIG_ACTIVE_MODE_TX_RF_ENABLE_POS                                                       (10U)
#define SYSTEM_CONFIG_ACTIVE_MODE_TX_RF_ENABLE_MASK                                                      (0x00000400U)  /**< rw-Set to 1; turning on the driver in reader or active mode is requested. Note: According to the setting of InitialRFOn; AutoRFOn and CAOn the driver is turned after a defined time and depended on the presence of an external RF field. Note: In case of an RFActiveError this bit is cleared by HW */
#define SYSTEM_CONFIG_AUTOCOLL_STATE_A_POS                                                               (9U)
#define SYSTEM_CONFIG_AUTOCOLL_STATE_A_MASK                                                              (0x00000200U)  /**< rw-*/
#define SYSTEM_CONFIG_SOFT_RESET_POS                                                                     (8U)
#define SYSTEM_CONFIG_SOFT_RESET_MASK                                                                    (0x00000100U)  /**< w--*/
#define SYSTEM_CONFIG_RESERVED_POS                                                                       (7U)
#define SYSTEM_CONFIG_RESERVED_MASK                                                                      (0x00000080U)  /**< r--*/
#define SYSTEM_CONFIG_MFC_CRYPTO_ON_POS                                                                  (6U)
#define SYSTEM_CONFIG_MFC_CRYPTO_ON_MASK                                                                 (0x00000040U)  /**< rw-If set to 1, the mfc-crypto bit is generated for end-/de-cryption*/
#define SYSTEM_CONFIG_PRBS_TYPE_POS                                                                      (5U)
#define SYSTEM_CONFIG_PRBS_TYPE_MASK                                                                     (0x00000020U)  /**< rw-Defines the PRBS type; If set to 1, PRBS15 is selected, default value 0 selects PRBS9*/
#define SYSTEM_CONFIG_RESERVED1_POS                                                                       (4U)
#define SYSTEM_CONFIG_RESERVED1_MASK                                                                      (0x00000010U)  /**< r--*/
#define SYSTEM_CONFIG_START_SEND_POS                                                                     (3U)
#define SYSTEM_CONFIG_START_SEND_MASK                                                                    (0x00000008U)  /**< rw-Set to logic 1; the data transmission is started. Note: This bit is only valid in combination with the Transceive command Note: If TxWait is set to a value other than zero the TxWait period configured must be expired as well that the transmission starts Note: As soon as the transmission started this bit is cleared by HW. */
#define SYSTEM_CONFIG_COMMAND_POS                                                                        (0U)
#define SYSTEM_CONFIG_COMMAND_MASK                                                                       (0x00000007U)  /**< rw-This registers hold the command bits 0* IDLE/StopCom Command; stops all ongoing communication and set the CLIF to IDLE mode; reset value 1 Transmit command; starts a transmission immediately 2 Receive command; enables the receiver. After end of reception the bits are clear and IDLE 3 Transceive command; initiates a transceive cycle. Note: Depending on the value of the Initiator bit a transmission is started or the receiver is enabled Note: The transceive command does not finish automatically. It stays in the transceive cycle until stopped via the IDLE/StopCom command 4 KeepCommand command; This command does not change the content of the command register and might be used in case other bits in the register are to be changed 5 LoopBack command; This command is for test purposes only. It starts a transmission and at the same enables the receiver. 6 - 7 Reserved: Do not use this settings  1*/

#define IRQ_ENABLE                                                                                        0x01U
#define IRQ_ENABLE_TEMPSENS_ERROR_IRQ_ENABLE_POS                                                         (16U)
#define IRQ_ENABLE_TEMPSENS_ERROR_IRQ_ENABLE_MASK                                                        (0x00010000U)  /**< -x-*/
#define IRQ_ENABLE_RX_SC_DET_IRQ_SET_ENABLE_POS                                                          (15U)
#define IRQ_ENABLE_RX_SC_DET_IRQ_SET_ENABLE_MASK                                                         (0x00008000U)  /**< -x-*/
#define IRQ_ENABLE_RX_SOF_DET_IRQ_SET_ENABLE_POS                                                         (14U)
#define IRQ_ENABLE_RX_SOF_DET_IRQ_SET_ENABLE_MASK                                                        (0x00004000U)  /**< -x-*/
#define IRQ_ENABLE_TIMER2_IRQ_SET_ENABLE_POS                                                             (13U)
#define IRQ_ENABLE_TIMER2_IRQ_SET_ENABLE_MASK                                                            (0x00002000U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_TIMER1_IRQ_SET_ENABLE_POS                                                             (12U)
#define IRQ_ENABLE_TIMER1_IRQ_SET_ENABLE_MASK                                                            (0x00001000U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_TIMER0_IRQ_SET_ENABLE_POS                                                             (11U)
#define IRQ_ENABLE_TIMER0_IRQ_SET_ENABLE_MASK                                                            (0x00000800U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_RF_ACTIVE_ERROR_IRQ_SET_ENABLE_POS                                                    (10U)
#define IRQ_ENABLE_RF_ACTIVE_ERROR_IRQ_SET_ENABLE_MASK                                                   (0x00000400U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_TX_RFON_IRQ_SET_ENABLE_POS                                                            (9U)
#define IRQ_ENABLE_TX_RFON_IRQ_SET_ENABLE_MASK                                                           (0x00000200U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_TX_RFOFF_IRQ_SET_ENABLE_POS                                                           (8U)
#define IRQ_ENABLE_TX_RFOFF_IRQ_SET_ENABLE_MASK                                                          (0x00000100U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_RFON_DET_IRQ_SET_ENABLE_POS                                                           (7U)
#define IRQ_ENABLE_RFON_DET_IRQ_SET_ENABLE_MASK                                                          (0x00000080U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_RFOFF_DET_IRQ_SET_ENABLE_POS                                                          (6U)
#define IRQ_ENABLE_RFOFF_DET_IRQ_SET_ENABLE_MASK                                                         (0x00000040U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_STATE_CHANGE_IRQ_SET_ENABLE_POS                                                       (5U)
#define IRQ_ENABLE_STATE_CHANGE_IRQ_SET_ENABLE_MASK                                                      (0x00000020U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_CARD_ACTIVATED_IRQ_SET_ENABLE_POS                                                     (4U)
#define IRQ_ENABLE_CARD_ACTIVATED_IRQ_SET_ENABLE_MASK                                                    (0x00000010U)  /**< -x-*/
#define IRQ_ENABLE_MODE_DETECTED_IRQ_SET_ENABLE_POS                                                      (3U)
#define IRQ_ENABLE_MODE_DETECTED_IRQ_SET_ENABLE_MASK                                                     (0x00000008U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_IDLE_IRQ_SET_ENABLE_POS                                                               (2U)
#define IRQ_ENABLE_IDLE_IRQ_SET_ENABLE_MASK                                                              (0x00000004U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_TX_IRQ_SET_ENABLE_POS                                                                 (1U)
#define IRQ_ENABLE_TX_IRQ_SET_ENABLE_MASK                                                                (0x00000002U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag */
#define IRQ_ENABLE_RX_IRQ_SET_ENABLE_POS                                                                 (0U)
#define IRQ_ENABLE_RX_IRQ_SET_ENABLE_MASK                                                                (0x00000001U)  /**< -x-Writing 1 to this register does set the corresponding IRQ ENABLE flag*/

#define IRQ_STATUS                                                                                        0x02U
#define IRQ_STATUS_LPCD_IRQ_POS                                                                          (19U)
#define IRQ_STATUS_LPCD_IRQ_MASK                                                                         (0x00080000U)  /**< r--*/
#define IRQ_STATUS_HV_ERROR_IRQ_POS                                                                      (18U)
#define IRQ_STATUS_HV_ERROR_IRQ_MASK                                                                     (0x00040000U)  /**< r--*/
#define IRQ_STATUS_GENERAL_ERROR_IRQ_POS                                                                 (17U)
#define IRQ_STATUS_GENERAL_ERROR_IRQ_MASK                                                                (0x00020000U)  /**< r--General ERROR IRQ*/
#define IRQ_STATUS_TEMPSENS_ERROR_IRQ_STATUS_POS                                                         (16U)
#define IRQ_STATUS_TEMPSENS_ERROR_IRQ_STATUS_MASK                                                        (0x00010000U)  /**< r--*/
#define IRQ_STATUS_RX_SC_DET_IRQ_POS                                                                     (15U)
#define IRQ_STATUS_RX_SC_DET_IRQ_MASK                                                                    (0x00008000U)  /**< r--*/
#define IRQ_STATUS_RX_SOF_DET_IRQ_POS                                                                    (14U)
#define IRQ_STATUS_RX_SOF_DET_IRQ_MASK                                                                   (0x00004000U)  /**< r--*/
#define IRQ_STATUS_TIMER2_IRQ_POS                                                                        (13U)
#define IRQ_STATUS_TIMER2_IRQ_MASK                                                                       (0x00002000U)  /**< r--*/
#define IRQ_STATUS_TIMER1_IRQ_POS                                                                        (12U)
#define IRQ_STATUS_TIMER1_IRQ_MASK                                                                       (0x00001000U)  /**< r--*/
#define IRQ_STATUS_TIMER0_IRQ_POS                                                                        (11U)
#define IRQ_STATUS_TIMER0_IRQ_MASK                                                                       (0x00000800U)  /**< r--*/
#define IRQ_STATUS_RF_ACTIVE_ERROR_IRQ_POS                                                               (10U)
#define IRQ_STATUS_RF_ACTIVE_ERROR_IRQ_MASK                                                              (0x00000400U)  /**< r--*/
#define IRQ_STATUS_TX_RFON_IRQ_POS                                                                       (9U)
#define IRQ_STATUS_TX_RFON_IRQ_MASK                                                                      (0x00000200U)  /**< r--*/
#define IRQ_STATUS_TX_RFOFF_IRQ_POS                                                                      (8U)
#define IRQ_STATUS_TX_RFOFF_IRQ_MASK                                                                     (0x00000100U)  /**< r--*/
#define IRQ_STATUS_RFON_DET_IRQ_POS                                                                      (7U)
#define IRQ_STATUS_RFON_DET_IRQ_MASK                                                                     (0x00000080U)  /**< r--*/
#define IRQ_STATUS_RFOFF_DET_IRQ_POS                                                                     (6U)
#define IRQ_STATUS_RFOFF_DET_IRQ_MASK                                                                    (0x00000040U)  /**< r--*/
#define IRQ_STATUS_STATE_CHANGE_IRQ_POS                                                                  (5U)
#define IRQ_STATUS_STATE_CHANGE_IRQ_MASK                                                                 (0x00000020U)  /**< r--*/
#define IRQ_STATUS_CARD_ACTIVATED_IRQ_POS                                                                (4U)
#define IRQ_STATUS_CARD_ACTIVATED_IRQ_MASK                                                               (0x00000010U)  /**< r--*/
#define IRQ_STATUS_MODE_DETECTED_IRQ_POS                                                                 (3U)
#define IRQ_STATUS_MODE_DETECTED_IRQ_MASK                                                                (0x00000008U)  /**< r--Set to 1 by HW; when the card mode has been detected by the ModeDetector Note: While the TypeA activation FSM is active no IRQ is issued any more */
#define IRQ_STATUS_IDLE_IRQ_POS                                                                          (2U)
#define IRQ_STATUS_IDLE_IRQ_MASK                                                                         (0x00000004U)  /**< r--Set to 1 by HW; when the IDLE state is entered */
#define IRQ_STATUS_TX_IRQ_POS                                                                            (1U)
#define IRQ_STATUS_TX_IRQ_MASK                                                                           (0x00000002U)  /**< r--Set to 1 by HW; when an ongoing transmission is finished. */
#define IRQ_STATUS_RX_IRQ_POS                                                                            (0U)
#define IRQ_STATUS_RX_IRQ_MASK                                                                           (0x00000001U)  /**< r--Set to 1 by HW, when an ongoing reception is finished*/

