Gloryfy/NFC/NfcdlibEx1_BasicDiscLoop_s32k118/NxpNfcRdLib/intfs/phhalHw_Ncx3330_Reg.h
#define IRQ_SET_CLEAR                                                                                     0x03U
#define IRQ_SET_CLEAR_LPCD_IRQ_CLR_POS                                                                   (19U)
#define IRQ_SET_CLEAR_LPCD_IRQ_CLR_MASK                                                                  (0x00080000U)  /**< w--*/
#define IRQ_SET_CLEAR_HV_ERROR_IRQ_CLR_POS                                                               (18U)
#define IRQ_SET_CLEAR_HV_ERROR_IRQ_CLR_MASK                                                              (0x00040000U)  /**< w--*/
#define IRQ_SET_CLEAR_GENERAL_ERROR_IRQ_CLR_POS                                                          (17U)
#define IRQ_SET_CLEAR_GENERAL_ERROR_IRQ_CLR_MASK                                                         (0x00020000U)  /**< w--*/
#define IRQ_SET_CLEAR_TEMPSENS_ERROR_IRQ_CLR_POS                                                         (16U)
#define IRQ_SET_CLEAR_TEMPSENS_ERROR_IRQ_CLR_MASK                                                        (0x00010000U)  /**< w--*/
#define IRQ_SET_CLEAR_RX_SC_DET_IRQ_CLR_POS                                                              (15U)
#define IRQ_SET_CLEAR_RX_SC_DET_IRQ_CLR_MASK                                                             (0x00008000U)  /**< w--*/
#define IRQ_SET_CLEAR_RX_SOF_DET_IRQ_CLR_POS                                                             (14U)
#define IRQ_SET_CLEAR_RX_SOF_DET_IRQ_CLR_MASK                                                            (0x00004000U)  /**< w--*/
#define IRQ_SET_CLEAR_TIMER2_IRQ_CLR_POS                                                                 (13U)
#define IRQ_SET_CLEAR_TIMER2_IRQ_CLR_MASK                                                                (0x00002000U)  /**< w--*/
#define IRQ_SET_CLEAR_TIMER1_IRQ_CLR_POS                                                                 (12U)
#define IRQ_SET_CLEAR_TIMER1_IRQ_CLR_MASK                                                                (0x00001000U)  /**< w--*/
#define IRQ_SET_CLEAR_TIMER0_IRQ_CLR_POS                                                                 (11U)
#define IRQ_SET_CLEAR_TIMER0_IRQ_CLR_MASK                                                                (0x00000800U)  /**< w--*/
#define IRQ_SET_CLEAR_RF_ACTIVE_ERROR_IRQ_CLR_POS                                                        (10U)
#define IRQ_SET_CLEAR_RF_ACTIVE_ERROR_IRQ_CLR_MASK                                                       (0x00000400U)  /**< w--*/
#define IRQ_SET_CLEAR_TX_RFON_IRQ_CLR_POS                                                                (9U)
#define IRQ_SET_CLEAR_TX_RFON_IRQ_CLR_MASK                                                               (0x00000200U)  /**< w--*/
#define IRQ_SET_CLEAR_TX_RFOFF_IRQ_CLR_POS                                                               (8U)
#define IRQ_SET_CLEAR_TX_RFOFF_IRQ_CLR_MASK                                                              (0x00000100U)  /**< w--*/
#define IRQ_SET_CLEAR_RFON_DET_IRQ_CLR_POS                                                               (7U)
#define IRQ_SET_CLEAR_RFON_DET_IRQ_CLR_MASK                                                              (0x00000080U)  /**< w--*/
#define IRQ_SET_CLEAR_RFOFF_DET_IRQ_CLR_POS                                                              (6U)
#define IRQ_SET_CLEAR_RFOFF_DET_IRQ_CLR_MASK                                                             (0x00000040U)  /**< w--*/
#define IRQ_SET_CLEAR_STATE_CHANGE_IRQ_CLR_POS                                                           (5U)
#define IRQ_SET_CLEAR_STATE_CHANGE_IRQ_CLR_MASK                                                          (0x00000020U)  /**< w--*/
#define IRQ_SET_CLEAR_CARD_ACTIVATED_IRQ_CLR_POS                                                         (4U)
#define IRQ_SET_CLEAR_CARD_ACTIVATED_IRQ_CLR_MASK                                                        (0x00000010U)  /**< w--*/
#define IRQ_SET_CLEAR_MODE_DETECTED_IRQ_CLR_POS                                                          (3U)
#define IRQ_SET_CLEAR_MODE_DETECTED_IRQ_CLR_MASK                                                         (0x00000008U)  /**< w--*/
#define IRQ_SET_CLEAR_IDLE_IRQ_CLR_POS                                                                   (2U)
#define IRQ_SET_CLEAR_IDLE_IRQ_CLR_MASK                                                                  (0x00000004U)  /**< w--*/
#define IRQ_SET_CLEAR_TX_IRQ_CLR_POS                                                                     (1U)
#define IRQ_SET_CLEAR_TX_IRQ_CLR_MASK                                                                    (0x00000002U)  /**< w--*/
#define IRQ_SET_CLEAR_RX_IRQ_CLR_POS                                                                     (0U)
#define IRQ_SET_CLEAR_RX_IRQ_CLR_MASK                                                                    (0x00000001U)  /**< w--*/

#define TRANSCEIVER_CONFIG                                                                                0x04U
#define TRANSCEIVER_CONFIG_STATE_TRIGGER_SELECT_POS                                                      (4U)
#define TRANSCEIVER_CONFIG_STATE_TRIGGER_SELECT_MASK                                                     (0x000003F0U)  /**< rw-Register to select the state to trigger the STATE_CHANGE_IRQ flag. Each bit of the bit field enables one state - several states are possible. Note: If all bits are 0 no IRQ is triggered. xxxxx1 IDLE state enabled to trigger IRQ xxxx1x WaitTransmit state enabled to trigger IRQ  xxx1xx Transmitting state enabled to trigger IRQ xx1xxx WaitReceive state enabled to trigger IRQ x1xxxx WaitForData state enabled to trigger IRQ 1xxxxx Receiving state enabled to trigger IRQ .*/
#define TRANSCEIVER_CONFIG_TX_SKIP_SEND_ENABLE_POS                                                       (3U)
#define TRANSCEIVER_CONFIG_TX_SKIP_SEND_ENABLE_MASK                                                      (0x00000008U)  /**< rw-If set to 1 not transmission is started after tx_wait is expired and START_SEND was set Note: The bit is cleared by HW when the WaitReceive state is entered.*/
#define TRANSCEIVER_CONFIG_TX_FRAMESTEP_ENABLE_POS                                                       (2U)
#define TRANSCEIVER_CONFIG_TX_FRAMESTEP_ENABLE_MASK                                                      (0x00000004U)  /**< rw-If set to 1; at every start of transmission; each byte of data is sent in a seperate frame. SOF and EOF is appended to the data byte according to the framing settings. After one byte is transmitted; the TxEncoder waits for a new start trigger to continue with the next byte. */
#define TRANSCEIVER_CONFIG_RX_MULTIPLE_ENABLE_POS                                                        (1U)
#define TRANSCEIVER_CONFIG_RX_MULTIPLE_ENABLE_MASK                                                       (0x00000002U)  /**< rw-If this bit is set to 1; the receiver is re-activated after the end of a reception. A statusbyte is written to the RAM containing all relevant status information of the frame. Note: Data in RAM is word aligned therefore empty bytes of a data Word in RAM are padded with 0x00 bytes. SW has to calculate the correct address for the following frame. */
#define TRANSCEIVER_CONFIG_INITIATOR_POS                                                                 (0U)
#define TRANSCEIVER_CONFIG_INITIATOR_MASK                                                                (0x00000001U)  /**< rw-Set to 1; the CLIF is configured for initiator mode. Depending on this setting the behavior of the transceive command is different*/

#define PADCONFIG_REG                                                                                     0x05U
#define PADCONFIG_REG_EN_SLEW_RATE_CONTROL_POS                                                           (7U)
#define PADCONFIG_REG_EN_SLEW_RATE_CONTROL_MASK                                                          (0x00000080U)  /**< rw-Enables slew rate control of digital pads*/
#define PADCONFIG_REG_GPIO7_DIR_POS                                                                      (6U)
#define PADCONFIG_REG_GPIO7_DIR_MASK                                                                     (0x00000040U)  /**< rw-Enables the input driver of GPIO7*/
#define PADCONFIG_REG_GPIO6_DIR_POS                                                                      (5U)
#define PADCONFIG_REG_GPIO6_DIR_MASK                                                                     (0x00000020U)  /**< rw-Enables the input driver of GPIO6*/
#define PADCONFIG_REG_GPIO5_DIR_POS                                                                      (4U)
#define PADCONFIG_REG_GPIO5_DIR_MASK                                                                     (0x00000010U)  /**< rw-Enables the input driver of GPIO5*/
#define PADCONFIG_REG_GPIO4_DIR_POS                                                                      (3U)
#define PADCONFIG_REG_GPIO4_DIR_MASK                                                                     (0x00000008U)  /**< rw-Enables the input driver of GPIO4*/
#define PADCONFIG_REG_GPIO3_DIR_POS                                                                      (2U)
#define PADCONFIG_REG_GPIO3_DIR_MASK                                                                     (0x00000004U)  /**< rw-Enables the input driver of GPIO3*/
#define PADCONFIG_REG_GPIO2_DIR_POS                                                                      (1U)
#define PADCONFIG_REG_GPIO2_DIR_MASK                                                                     (0x00000002U)  /**< rw-Enables the input driver of GPIO2*/
#define PADCONFIG_REG_GPIO1_DIR_POS                                                                      (0U)
#define PADCONFIG_REG_GPIO1_DIR_MASK                                                                     (0x00000001U)  /**< rw-Enables the input driver of GPIO1*/

#define PADIN_REG                                                                                         0x06U
#define PADIN_REG_GPIO7_IN_VAL_POS                                                                       (6U)
#define PADIN_REG_GPIO7_IN_VAL_MASK                                                                      (0x00000040U)  /**< -*/
#define PADIN_REG_GPIO6_IN_VAL_POS                                                                       (5U)
#define PADIN_REG_GPIO6_IN_VAL_MASK                                                                      (0x00000020U)  /**< -*/
#define PADIN_REG_GPIO5_IN_VAL_POS                                                                       (4U)
#define PADIN_REG_GPIO5_IN_VAL_MASK                                                                      (0x00000010U)  /**< -*/
#define PADIN_REG_GPIO4_IN_VAL_POS                                                                       (3U)
#define PADIN_REG_GPIO4_IN_VAL_MASK                                                                      (0x00000008U)  /**< -*/
#define PADIN_REG_GPIO3_IN_VAL_POS                                                                       (2U)
#define PADIN_REG_GPIO3_IN_VAL_MASK                                                                      (0x00000004U)  /**< -*/
#define PADIN_REG_GPIO2_IN_VAL_POS                                                                       (1U)
#define PADIN_REG_GPIO2_IN_VAL_MASK                                                                      (0x00000002U)  /**< -*/
#define PADIN_REG_GPIO1_IN_VAL_POS                                                                       (0U)
#define PADIN_REG_GPIO1_IN_VAL_MASK                                                                      (0x00000001U)  /**< -*/

#define PADOUT_REG                                                                                        0x07U
#define PADOUT_REG_GPIO7_OUT_VAL_POS                                                                     (6U)
#define PADOUT_REG_GPIO7_OUT_VAL_MASK                                                                    (0x00000040U)  /**< rw-*/
#define PADOUT_REG_GPIO6_OUT_VAL_POS                                                                     (5U)
#define PADOUT_REG_GPIO6_OUT_VAL_MASK                                                                    (0x00000020U)  /**< rw-*/
#define PADOUT_REG_GPIO5_OUT_VAL_POS                                                                     (4U)
#define PADOUT_REG_GPIO5_OUT_VAL_MASK                                                                    (0x00000010U)  /**< rw-*/
#define PADOUT_REG_GPIO4_OUT_VAL_POS                                                                     (3U)
#define PADOUT_REG_GPIO4_OUT_VAL_MASK                                                                    (0x00000008U)  /**< rw-*/
#define PADOUT_REG_GPIO3_OUT_VAL_POS                                                                     (2U)
#define PADOUT_REG_GPIO3_OUT_VAL_MASK                                                                    (0x00000004U)  /**< rw-*/
#define PADOUT_REG_GPIO2_OUT_VAL_POS                                                                     (1U)
#define PADOUT_REG_GPIO2_OUT_VAL_MASK                                                                    (0x00000002U)  /**< rw-*/
#define PADOUT_REG_GPIO1_OUT_VAL_POS                                                                     (0U)
#define PADOUT_REG_GPIO1_OUT_VAL_MASK                                                                    (0x00000001U)  /**< rw-*/

#define TIMER0_STATUS                                                                                     0x08U
#define TIMER0_STATUS_T0_RUNNING_POS                                                                     (20U)
#define TIMER0_STATUS_T0_RUNNING_MASK                                                                    (0x00100000U)  /**< r--Indicates that timer T0 is running (busy) */
#define TIMER0_STATUS_T0_VALUE_POS                                                                       (0U)
#define TIMER0_STATUS_T0_VALUE_MASK                                                                      (0x000FFFFFU)  /**< r--Value of 20bit counter in timer T0 */

#define TIMER1_STATUS                                                                                     0x09U
#define TIMER1_STATUS_T1_RUNNING_POS                                                                     (20U)
#define TIMER1_STATUS_T1_RUNNING_MASK                                                                    (0x00100000U)  /**< r--Indicates that timer T1 is running (busy) */
#define TIMER1_STATUS_T1_VALUE_POS                                                                       (0U)
#define TIMER1_STATUS_T1_VALUE_MASK                                                                      (0x000FFFFFU)  /**< r--Value of 20bit counter in timer T1 */

#define TIMER2_STATUS                                                                                     0x0AU
#define TIMER2_STATUS_T2_RUNNING_POS                                                                     (20U)
#define TIMER2_STATUS_T2_RUNNING_MASK                                                                    (0x00100000U)  /**< r--Indicates that timer T2 is running (busy) */
#define TIMER2_STATUS_T2_VALUE_POS                                                                       (0U)
#define TIMER2_STATUS_T2_VALUE_MASK                                                                      (0x000FFFFFU)  /**< r--Value of 20bit counter in timer T2 */

#define TIMER0_RELOAD                                                                                     0x0BU
#define TIMER0_RELOAD_T0_RELOAD_VALUE_POS                                                                (0U)
#define TIMER0_RELOAD_T0_RELOAD_VALUE_MASK                                                               (0x000FFFFFU)  /**< rw-Reload value of the timer T0. */

#define TIMER1_RELOAD                                                                                     0x0CU
#define TIMER1_RELOAD_T1_RELOAD_VALUE_POS                                                                (0U)
#define TIMER1_RELOAD_T1_RELOAD_VALUE_MASK                                                               (0x000FFFFFU)  /**< rw-Reload value of the timer T1.*/

#define TIMER2_RELOAD                                                                                     0x0DU
#define TIMER2_RELOAD_T2_RELOAD_VALUE_POS                                                                (0U)
#define TIMER2_RELOAD_T2_RELOAD_VALUE_MASK                                                               (0x000FFFFFU)  /**< rw-Reload value of the timer T2. */

#define TIMER0_CONFIG                                                                                     0x0EU
#define TIMER0_CONFIG_T0_STOP_ON_RX_STARTED_POS                                                          (20U)
#define TIMER0_CONFIG_T0_STOP_ON_RX_STARTED_MASK                                                         (0x00100000U)  /**< rw-T0_STOP_EVENT: If set; the timer T0 is stopped when a data reception begins (1st bit is received). */
#define TIMER0_CONFIG_T0_STOP_ON_TX_STARTED_POS                                                          (19U)
#define TIMER0_CONFIG_T0_STOP_ON_TX_STARTED_MASK                                                         (0x00080000U)  /**< rw-T0_STOP_EVENT: If set; the timer T0 is stopped when a data transmission begins. */
#define TIMER0_CONFIG_T0_STOP_ON_RF_ON_EXT_POS                                                           (18U)
#define TIMER0_CONFIG_T0_STOP_ON_RF_ON_EXT_MASK                                                          (0x00040000U)  /**< rw-T0_STOP_EVENT: If set; the timer T0 is stopped when the external RF field is detected.*/
#define TIMER0_CONFIG_T0_STOP_ON_RF_OFF_EXT_POS                                                          (17U)
#define TIMER0_CONFIG_T0_STOP_ON_RF_OFF_EXT_MASK                                                         (0x00020000U)  /**< rw-T0_STOP_EVENT: If set; the timer T0 is stopped when the external RF field vanishes. */
#define TIMER0_CONFIG_T0_STOP_ON_RF_ON_INT_POS                                                           (16U)
#define TIMER0_CONFIG_T0_STOP_ON_RF_ON_INT_MASK                                                          (0x00010000U)  /**< rw-T0_STOP_EVENT: If set; the timer T0 is stopped when the internal RF field is turned on. */
#define TIMER0_CONFIG_T0_STOP_ON_RF_OFF_INT_POS                                                          (15U)
#define TIMER0_CONFIG_T0_STOP_ON_RF_OFF_INT_MASK                                                         (0x00008000U)  /**< rw-T0_STOP_EVENT: If set; the timer T0 is stopped when the internal RF field is turned off. */
#define TIMER0_CONFIG_T0_START_ON_RX_STARTED_POS                                                         (14U)
#define TIMER0_CONFIG_T0_START_ON_RX_STARTED_MASK                                                        (0x00004000U)  /**< rw-T0_START_EVENT: If set; the timer T0 is started when a data reception begins (1st bit is received). */
#define TIMER0_CONFIG_T0_START_ON_RX_ENDED_POS                                                           (13U)
#define TIMER0_CONFIG_T0_START_ON_RX_ENDED_MASK                                                          (0x00002000U)  /**< rw-T0_START_EVENT: If set; the timer T0 is started when a data reception ends. */
#define TIMER0_CONFIG_T0_START_ON_TX_STARTED_POS                                                         (12U)
#define TIMER0_CONFIG_T0_START_ON_TX_STARTED_MASK                                                        (0x00001000U)  /**< rw-T0_START_EVENT: If set; the timer T0 is started when a data transmission begins. */
#define TIMER0_CONFIG_T0_START_ON_TX_ENDED_POS                                                           (11U)
#define TIMER0_CONFIG_T0_START_ON_TX_ENDED_MASK                                                          (0x00000800U)  /**< rw-T0_START_EVENT: If set; the timer T0 is started when a data transmission ends. */
#define TIMER0_CONFIG_T0_START_ON_RF_ON_EXT_POS                                                          (10U)
#define TIMER0_CONFIG_T0_START_ON_RF_ON_EXT_MASK                                                         (0x00000400U)  /**< rw-T0_START_EVENT: If set; the timer T0 is startedwhen the external RF field is detected. */
#define TIMER0_CONFIG_T0_START_ON_RF_OFF_EXT_POS                                                         (9U)
#define TIMER0_CONFIG_T0_START_ON_RF_OFF_EXT_MASK                                                        (0x00000200U)  /**< rw-T0_START_EVENT: If set; the timer T0 is started when the external RF field is not detected any more. */
#define TIMER0_CONFIG_T0_START_ON_RF_ON_INT_POS                                                          (8U)
#define TIMER0_CONFIG_T0_START_ON_RF_ON_INT_MASK                                                         (0x00000100U)  /**< rw-T0_START_EVENT: If set; the timer T0 is started when an internal RF field is turned on. */
#define TIMER0_CONFIG_T0_START_ON_RF_OFF_INT_POS                                                         (7U)
#define TIMER0_CONFIG_T0_START_ON_RF_OFF_INT_MASK                                                        (0x00000080U)  /**< rw-T0_START_EVENT:If set; the timer T0 is started when an internal RF field is turned off. */
#define TIMER0_CONFIG_T0_START_NOW_POS                                                                   (6U)
#define TIMER0_CONFIG_T0_START_NOW_MASK                                                                  (0x00000040U)  /**< rw-T0_START_EVENT: If set; the timer T0 is started immediatly. */
#define TIMER0_CONFIG_T0_PRESCALE_SEL_POS                                                                (3U)
#define TIMER0_CONFIG_T0_PRESCALE_SEL_MASK                                                               (0x00000038U)  /**< rw-Controls frequency/period of the timer T0 when the prescaler is activated in T0_MODE_SEL. 000b* 6.78MHz counter 001b 3.39MHz counter 010b 1.70MHz counter 011b 848kHz counter 100b 424kHz counter 101b 212kHz counter 110b 106kHz counter 111b 53kHz counter   */
#define TIMER0_CONFIG_T0_MODE_SEL_POS                                                                    (2U)
#define TIMER0_CONFIG_T0_MODE_SEL_MASK                                                                   (0x00000004U)  /**< rw-Configuration of the timer T0 clock. 0b* Prescaler is disabled: the timer frequency matches CLIF clock frequency (13.56MHz). 1b Prescaler is enabled: the timer operates on the prescaler signal frequency (chosen by T0_PRESCALE_SEL).*/
#define TIMER0_CONFIG_T0_RELOAD_ENABLE_POS                                                               (1U)
#define TIMER0_CONFIG_T0_RELOAD_ENABLE_MASK                                                              (0x00000002U)  /**< rw-If set to 0;the timer T0 will stop on expiration. 0* After expiration the timer T0 will stop counting; i.e.; remain zero; reset value. 1 After expiration the timer T0 will reload its preset value and continue counting down. */
#define TIMER0_CONFIG_T0_ENABLE_POS                                                                      (0U)
#define TIMER0_CONFIG_T0_ENABLE_MASK                                                                     (0x00000001U)  /**< rw-Enables the timer T0*/

