Gloryfy/NFC/NfcdlibEx1_BasicDiscLoop_s32k118/NxpNfcRdLib/intfs/phhalHw_Ncx3330_Reg.h
#define TIMER1_CONFIG                                                                                     0x0FU
#define TIMER1_CONFIG_T1_STOP_ON_RX_STARTED_POS                                                          (20U)
#define TIMER1_CONFIG_T1_STOP_ON_RX_STARTED_MASK                                                         (0x00100000U)  /**< rw-T1_STOP_EVENT: If set; the timer T1 is stopped when a data reception begins (1st bit is received). */
#define TIMER1_CONFIG_T1_STOP_ON_TX_STARTED_POS                                                          (19U)
#define TIMER1_CONFIG_T1_STOP_ON_TX_STARTED_MASK                                                         (0x00080000U)  /**< rw-T1_STOP_EVENT: If set; the timer T1 is stopped when a data transmission begins. */
#define TIMER1_CONFIG_T1_STOP_ON_RF_ON_EXT_POS                                                           (18U)
#define TIMER1_CONFIG_T1_STOP_ON_RF_ON_EXT_MASK                                                          (0x00040000U)  /**< rw-T1_STOP_EVENT: If set; the timer T1 is stopped when the external RF field is detected. */
#define TIMER1_CONFIG_T1_STOP_ON_RF_OFF_EXT_POS                                                          (17U)
#define TIMER1_CONFIG_T1_STOP_ON_RF_OFF_EXT_MASK                                                         (0x00020000U)  /**< rw-T1_STOP_EVENT: If set; the timer T1 is stopped when the external RF field vanishes. */
#define TIMER1_CONFIG_T1_STOP_ON_RF_ON_INT_POS                                                           (16U)
#define TIMER1_CONFIG_T1_STOP_ON_RF_ON_INT_MASK                                                          (0x00010000U)  /**< rw-T1_STOP_EVENT: If set; the timer T1 is stopped when the internal RF field is turned on. */
#define TIMER1_CONFIG_T1_STOP_ON_RF_OFF_INT_POS                                                          (15U)
#define TIMER1_CONFIG_T1_STOP_ON_RF_OFF_INT_MASK                                                         (0x00008000U)  /**< rw-T1_STOP_EVENT: If set; the timer T1 is stopped when the internal RF field is turned off. */
#define TIMER1_CONFIG_T1_START_ON_RX_STARTED_POS                                                         (14U)
#define TIMER1_CONFIG_T1_START_ON_RX_STARTED_MASK                                                        (0x00004000U)  /**< rw-T1_START_EVENT: If set; the timer T1 is started when a data reception begins (1st bit is received). */
#define TIMER1_CONFIG_T1_START_ON_RX_ENDED_POS                                                           (13U)
#define TIMER1_CONFIG_T1_START_ON_RX_ENDED_MASK                                                          (0x00002000U)  /**< rw-T1_START_EVENT: If set; the timer T1 is started when a data reception ends. */
#define TIMER1_CONFIG_T1_START_ON_TX_STARTED_POS                                                         (12U)
#define TIMER1_CONFIG_T1_START_ON_TX_STARTED_MASK                                                        (0x00001000U)  /**< rw-T1_START_EVENT: If set; the timer T1 is started when a data transmission begins.   */
#define TIMER1_CONFIG_T1_START_ON_TX_ENDED_POS                                                           (11U)
#define TIMER1_CONFIG_T1_START_ON_TX_ENDED_MASK                                                          (0x00000800U)  /**< rw-T1_START_EVENT: If set; the timer T1 is started when a data transmission ends. */
#define TIMER1_CONFIG_T1_START_ON_RF_ON_EXT_POS                                                          (10U)
#define TIMER1_CONFIG_T1_START_ON_RF_ON_EXT_MASK                                                         (0x00000400U)  /**< rw-T1_START_EVENT: If set; the timer T1 is startedwhen the external RF field is detected. */
#define TIMER1_CONFIG_T1_START_ON_RF_OFF_EXT_POS                                                         (9U)
#define TIMER1_CONFIG_T1_START_ON_RF_OFF_EXT_MASK                                                        (0x00000200U)  /**< rw-T1_START_EVENT: If set; the timer T1 is started when the external RF field is not detected any more. */
#define TIMER1_CONFIG_T1_START_ON_RF_ON_INT_POS                                                          (8U)
#define TIMER1_CONFIG_T1_START_ON_RF_ON_INT_MASK                                                         (0x00000100U)  /**< rw-T1_START_EVENT: If set; the timer T1 is started when an internal RF field is turned on. */
#define TIMER1_CONFIG_T1_START_ON_RF_OFF_INT_POS                                                         (7U)
#define TIMER1_CONFIG_T1_START_ON_RF_OFF_INT_MASK                                                        (0x00000080U)  /**< rw-T1_START_EVENT:If set; the timer T1 is started when an internal RF field is turned off. */
#define TIMER1_CONFIG_T1_START_NOW_POS                                                                   (6U)
#define TIMER1_CONFIG_T1_START_NOW_MASK                                                                  (0x00000040U)  /**< rw-T1_START_EVENT: If set; the timer T1 is started immediatly. */
#define TIMER1_CONFIG_T1_PRESCALE_SEL_POS                                                                (3U)
#define TIMER1_CONFIG_T1_PRESCALE_SEL_MASK                                                               (0x00000038U)  /**< rw-Controls frequency/period of the timer T1 when the prescaler is activated by T1_MODE_SEL. 000b* 6.78MHz counter 001b 3.39MHz counter 010b 1.70MHz counter 011b 848kHz counter 100b 424kHz counter 101b 212kHz counter 110b 106kHz counter 111b 53kHz counter */
#define TIMER1_CONFIG_T1_MODE_SEL_POS                                                                    (2U)
#define TIMER1_CONFIG_T1_MODE_SEL_MASK                                                                   (0x00000004U)  /**< rw-If set; the timer T1 is started the prescaler for the timer T1 is enabled. 0* Prescaler is disabled: the timer frequency matches CLIF clock frequency (13.56MHz). 1 Prescaler is enabled: the timer operates on the prescaler signal frequency (chosen by T1_PRESCALE_SEL). */
#define TIMER1_CONFIG_T1_RELOAD_ENABLE_POS                                                               (1U)
#define TIMER1_CONFIG_T1_RELOAD_ENABLE_MASK                                                              (0x00000002U)  /**< rw-If set to 0;the timer T1 will stop on expiration. 0* After expiration the timer T1 will stop counting; i.e.; remain zero; reset value. 1 After expiration the timer T1 will reload its preset value and continue counting down. */
#define TIMER1_CONFIG_T1_ENABLE_POS                                                                      (0U)
#define TIMER1_CONFIG_T1_ENABLE_MASK                                                                     (0x00000001U)  /**< rw-Enables the timer T1*/

#define TIMER2_CONFIG                                                                                     0x10U
#define TIMER2_CONFIG_T2_STOP_ON_RX_STARTED_POS                                                          (20U)
#define TIMER2_CONFIG_T2_STOP_ON_RX_STARTED_MASK                                                         (0x00100000U)  /**< rw-T2_STOP_EVENT: If set; the timer T2 is stopped when a data reception begins (1st bit is received). */
#define TIMER2_CONFIG_T2_STOP_ON_TX_STARTED_POS                                                          (19U)
#define TIMER2_CONFIG_T2_STOP_ON_TX_STARTED_MASK                                                         (0x00080000U)  /**< rw-T2_STOP_EVENT: If set; the timer T2 is stopped when a data transmission begins. */
#define TIMER2_CONFIG_T2_STOP_ON_RF_ON_EXT_POS                                                           (18U)
#define TIMER2_CONFIG_T2_STOP_ON_RF_ON_EXT_MASK                                                          (0x00040000U)  /**< rw-T2_STOP_EVENT: If set; the timer T2 is stopped when the external RF field is detected. */
#define TIMER2_CONFIG_T2_STOP_ON_RF_OFF_EXT_POS                                                          (17U)
#define TIMER2_CONFIG_T2_STOP_ON_RF_OFF_EXT_MASK                                                         (0x00020000U)  /**< rw-T2_STOP_EVENT: If set; the timer T2 is stopped when the external RF field vanishes. */
#define TIMER2_CONFIG_T2_STOP_ON_RF_ON_INT_POS                                                           (16U)
#define TIMER2_CONFIG_T2_STOP_ON_RF_ON_INT_MASK                                                          (0x00010000U)  /**< rw-T2_STOP_EVENT: If set; the timer T2 is stopped when the internal RF field is turned on. */
#define TIMER2_CONFIG_T2_STOP_ON_RF_OFF_INT_POS                                                          (15U)
#define TIMER2_CONFIG_T2_STOP_ON_RF_OFF_INT_MASK                                                         (0x00008000U)  /**< rw-T2_STOP_EVENT: If set; the timer T2 is stopped when the internal RF field is turned off. */
#define TIMER2_CONFIG_T2_START_ON_RX_STARTED_POS                                                         (14U)
#define TIMER2_CONFIG_T2_START_ON_RX_STARTED_MASK                                                        (0x00004000U)  /**< rw-T2_START_EVENT: If set; the timer T2 is started when a data reception begins (1st bit is received). */
#define TIMER2_CONFIG_T2_START_ON_RX_ENDED_POS                                                           (13U)
#define TIMER2_CONFIG_T2_START_ON_RX_ENDED_MASK                                                          (0x00002000U)  /**< rw-T2_START_EVENT: If set; the timer T2 is started when a data reception ends. */
#define TIMER2_CONFIG_T2_START_ON_TX_STARTED_POS                                                         (12U)
#define TIMER2_CONFIG_T2_START_ON_TX_STARTED_MASK                                                        (0x00001000U)  /**< rw-T2_START_EVENT: If set; the timer T2 is started when a data transmission begins. */
#define TIMER2_CONFIG_T2_START_ON_TX_ENDED_POS                                                           (11U)
#define TIMER2_CONFIG_T2_START_ON_TX_ENDED_MASK                                                          (0x00000800U)  /**< rw-T2_START_EVENT: If set; the timer T2 is started when a data transmission ends. */
#define TIMER2_CONFIG_T2_START_ON_RF_ON_EXT_POS                                                          (10U)
#define TIMER2_CONFIG_T2_START_ON_RF_ON_EXT_MASK                                                         (0x00000400U)  /**< rw-T2_START_EVENT: If set; the timer T2 is started when the external RF field is detected. */
#define TIMER2_CONFIG_T2_START_ON_RF_OFF_EXT_POS                                                         (9U)
#define TIMER2_CONFIG_T2_START_ON_RF_OFF_EXT_MASK                                                        (0x00000200U)  /**< rw-T2_START_EVENT: If set; the timer T2 is started when the external RF field is not detected any more. */
#define TIMER2_CONFIG_T2_START_ON_RF_ON_INT_POS                                                          (8U)
#define TIMER2_CONFIG_T2_START_ON_RF_ON_INT_MASK                                                         (0x00000100U)  /**< rw-T2_START_EVENT: If set; the timer T2 is started when an internal RF field is turned on. */
#define TIMER2_CONFIG_T2_START_ON_RF_OFF_INT_POS                                                         (7U)
#define TIMER2_CONFIG_T2_START_ON_RF_OFF_INT_MASK                                                        (0x00000080U)  /**< rw-T2_START_EVENT: If set; the timer T2 is started when an internal RF field is turned off. */
#define TIMER2_CONFIG_T2_START_NOW_POS                                                                   (6U)
#define TIMER2_CONFIG_T2_START_NOW_MASK                                                                  (0x00000040U)  /**< rw-T2_START_EVENT: If set; the timer T2 is started immediatly. */
#define TIMER2_CONFIG_T2_PRESCALE_SEL_POS                                                                (3U)
#define TIMER2_CONFIG_T2_PRESCALE_SEL_MASK                                                               (0x00000038U)  /**< rw-Controls frequency/period of the timer T2 when the prescaler is activated by T2_MODE_SEL. 000b* 6.78MHz counter 001b 3.39MHz counter 010b 1.70MHz counter 011b 848kHz counter 100b 424kHz counter 101b 212kHz counter 110b 106kHz counter 111b 53kHz counter */
#define TIMER2_CONFIG_T2_MODE_SEL_POS                                                                    (2U)
#define TIMER2_CONFIG_T2_MODE_SEL_MASK                                                                   (0x00000004U)  /**< rw-If set; the timer T2 is started the prescaler for the timer T2 is enabled. 0* Prescaler is disabled: the timer frequency matches CLIF clock frequency (13.56MHz). 1 Prescaler is enabled: the timer operates on the prescaler signal frequency (chosen by T2_PRESCALE_SEL). */
#define TIMER2_CONFIG_T2_RELOAD_ENABLE_POS                                                               (1U)
#define TIMER2_CONFIG_T2_RELOAD_ENABLE_MASK                                                              (0x00000002U)  /**< rw-If set to 0;the timer T2 will stop on expiration. 0* After expiration the timer T2 will stop counting; i.e.; remain zero; reset value. 1 After expiration the timer T2 will reload its preset value and continue counting down. */
#define TIMER2_CONFIG_T2_ENABLE_POS                                                                      (0U)
#define TIMER2_CONFIG_T2_ENABLE_MASK                                                                     (0x00000001U)  /**< rw-Enables the timer T2 */

#define RX_WAIT_CONFIG                                                                                    0x11U
#define RX_WAIT_CONFIG_RX_WAIT_VALUE_POS                                                                 (8U)
#define RX_WAIT_CONFIG_RX_WAIT_VALUE_MASK                                                                (0x0FFFFF00U)  /**< rw-Defines the rx_wait timer reload value. Note: If set to 00000h the rx_wait guard time is disabled */
#define RX_WAIT_CONFIG_RX_WAIT_PRESCALER_POS                                                             (0U)
#define RX_WAIT_CONFIG_RX_WAIT_PRESCALER_MASK                                                            (0x000000FFU)  /**< rw-Defines the prescaler reload value for the rx_wait timer.*/

#define CRC_RX_CONFIG                                                                                     0x12U
#define CRC_RX_CONFIG_RX_CRC_PRESET_VALUE_POS                                                            (16U)
#define CRC_RX_CONFIG_RX_CRC_PRESET_VALUE_MASK                                                           (0xFFFF0000U)  /**< rw-Arbitrary preset value for the Rx-Decoder CRC calculation. */
#define CRC_RX_CONFIG_RESERVED_POS                                                                       (12U)
#define CRC_RX_CONFIG_RESERVED_MASK                                                                      (0x0000F000U)  /**< r--*/
#define CRC_RX_CONFIG_RX_PARITY_TYPE_POS                                                                 (11U)
#define CRC_RX_CONFIG_RX_PARITY_TYPE_MASK                                                                (0x00000800U)  /**< rw-Defines which type of the parity-bit is used Note: This bit is set by the mod-detector if automatic mode detection is enabled and ISO14443A communication is detected. 0 Even parity calculation is used 1 Odd parity calculation is used */
#define CRC_RX_CONFIG_RX_PARITY_ENABLE_POS                                                               (10U)
#define CRC_RX_CONFIG_RX_PARITY_ENABLE_MASK                                                              (0x00000400U)  /**< rw-If set to 1; a parity-bit for each byte is expected; will be extracted from data stream and checked for correctness. In case the parity-bit is incorrect; the RX_DATA_INTEGRITY_ERROR flag is set. Nevertheless the reception is continued. Note: This bit is set by the mod-detector if automatic mode detection is enabled and ISO14443A communication is detected.*/
#define CRC_RX_CONFIG_VALUES_AFTER_COLLISION_POS                                                         (9U)
#define CRC_RX_CONFIG_VALUES_AFTER_COLLISION_MASK                                                        (0x00000200U)  /**< rw-This bit defined the value of bits received after a collision occured. 0* All received bits after a collision will be cleared. 1 All received bits after a collision keep their value. */
#define CRC_RX_CONFIG_RX_BIT_ALIGN_POS                                                                   (6U)
#define CRC_RX_CONFIG_RX_BIT_ALIGN_MASK                                                                  (0x000001C0U)  /**< rw-RxAlign defines the bit position within the byte for the first bit received. Further received bits are stored at the following bit positions.    */
#define CRC_RX_CONFIG_RX_CRC_PRESET_SEL_POS                                                              (3U)
#define CRC_RX_CONFIG_RX_CRC_PRESET_SEL_MASK                                                             (0x00000038U)  /**< rw-Preset value of the CRC register for the Rx-Decoder. For a CRC calculation using 5bits, only the LSByte is used. 000b* 0000h, reset value Note that this configuration is set by the Mode detector for FeliCa. 001b  6363h Note that this configuration is set by the Mode detector for ISO14443 type A. 010b  A671h 011b FFFFh Note that this configuration is set by the Mode detector for ISO14443 type B. 100b 0012h 101b E012h 110b RFU 111b Use arbitrary preset value RX_CRC_PRESET_VALUE*/
#define CRC_RX_CONFIG_RX_CRC_TYPE_POS                                                                    (2U)
#define CRC_RX_CONFIG_RX_CRC_TYPE_MASK                                                                   (0x00000004U)  /**< rw-Controls the type of CRC calulation for the Rx-Decoder 0* 16bit CRC calculation; reset value 1 5bit CRC calculation */
#define CRC_RX_CONFIG_RX_CRC_INV_POS                                                                     (1U)
#define CRC_RX_CONFIG_RX_CRC_INV_MASK                                                                    (0x00000002U)  /**< rw-Controls the comparison of the CRC checksum for the Rx-Decoder 0* Not inverted CRC value: 0000h, reset value Note that this nit is cleared by the Mode detector for ISO14443 type A and FeliCa. 1 Inverted CRC value: F0B8h Note that this bit is set by the Mode detector for ISO14443 type B.*/
#define CRC_RX_CONFIG_RX_CRC_ENABLE_POS                                                                  (0U)
#define CRC_RX_CONFIG_RX_CRC_ENABLE_MASK                                                                 (0x00000001U)  /**< rw-If set; the Rx-Decoder will check the CRC for correctness. Note that this bit is set by the Mode Detector; when ISO14443 type B; or FeliCa (212 or 424kBd) is detected.*/

