Gloryfy/NFC/NfcdlibEx1_BasicDiscLoop_s32k118/NxpNfcRdLib/intfs/phhalHw_Ncx3330_Reg.h
#define RX_STATUS                                                                                         0x13U
#define RX_STATUS_RX_COLL_POS_POS                                                                        (19U)
#define RX_STATUS_RX_COLL_POS_MASK                                                                       (0x03F80000U)  /**< r--These bits show the bit position of the first detected collision in a received frame (only databits are interpreted). Note: These bits shall only be interpreted in passive communication mode at 106 kbit/s or ISO14443-3 TypeA reader / writer or ICode SLI reader / writer mode if bit CollPosValid is set to 1. Note: If RX_ALIGN is set to a value different to 0;this value is included in the RX_COLL_POS. */
#define RX_STATUS_RX_COLLISION_DETECTED_POS                                                              (18U)
#define RX_STATUS_RX_COLLISION_DETECTED_MASK                                                             (0x00040000U)  /**< r--This flag is set to 1; when a collision has accured. The position of the first collision is shown in the register RX_COLLPOS*/
#define RX_STATUS_RX_PROTOCOL_ERROR_POS                                                                  (17U)
#define RX_STATUS_RX_PROTOCOL_ERROR_MASK                                                                 (0x00020000U)  /**< r--This flag is set to 1; when a protocol error has accured. A protocol error can be a wrong stopbit; a missing or wrong ISO14443B EOF or SOF or a wrong number of received data bytes. Note: When a protocol error is detected; data reception is stopped. Note: The flag is automatically cleared at start of next reception. */
#define RX_STATUS_RX_DATA_INTEGRITY_ERROR_POS                                                            (16U)
#define RX_STATUS_RX_DATA_INTEGRITY_ERROR_MASK                                                           (0x00010000U)  /**< r--This flag is set to 1; if a data integrity error has been detected. Possible caused can be a wrong parity or a wrong CRC. Note: On a data integrity error the reception is continued Note: The flag is automatically cleared at start of next reception. Note: If a reversed parity bit is a stop criteria; the flag is not set to 1 in case of a wrong parity. */
#define RX_STATUS_RX_NUM_LAST_BITS_POS                                                                   (13U)
#define RX_STATUS_RX_NUM_LAST_BITS_MASK                                                                  (0x0000E000U)  /**< r--Defines the number of valid bits of the last data byte received in bit-oriented communications. If zero the whole byte is valid. */
#define RX_STATUS_RX_NUM_FRAMES_RECEIVED_POS                                                             (9U)
#define RX_STATUS_RX_NUM_FRAMES_RECEIVED_MASK                                                            (0x00001E00U)  /**< r--Indicates the number of frames received. The value is updated when the RxIRQ is raised. Note: This bit field is only valid when the RxMultiple is active (bit RX_MULTIPLE_ENABLE set) */
#define RX_STATUS_RX_NUM_BYTES_RECEIVED_POS                                                              (0U)
#define RX_STATUS_RX_NUM_BYTES_RECEIVED_MASK                                                             (0x000001FFU)  /**< r--the number of bytes received. The value is valid when the RxIRQ is raised until the receiver is enabled again.*/

#define TX_UNDERSHOOT_CONFIG                                                                              0x14U
#define TX_UNDERSHOOT_CONFIG_TX_UNDERSHOOT_PATTERN_POS                                                   (16U)
#define TX_UNDERSHOOT_CONFIG_TX_UNDERSHOOT_PATTERN_MASK                                                  (0xFFFF0000U)  /**< rw-Undershoot pattern which is transmitted after each falling egde. */
#define TX_UNDERSHOOT_CONFIG_RESERVED_POS                                                                (5U)
#define TX_UNDERSHOOT_CONFIG_RESERVED_MASK                                                               (0x0000FFE0U)  /**< r--Reserved */
#define TX_UNDERSHOOT_CONFIG_TX_UNDERSHOOT_PATTERN_LEN_POS                                               (1U)
#define TX_UNDERSHOOT_CONFIG_TX_UNDERSHOOT_PATTERN_LEN_MASK                                              (0x0000001EU)  /**< rw-Defines length of the undershoot prevention pattern (value +1U). The pattern is applied starting from the LSB of the defined pattern; all other bits are ignored. */
#define TX_UNDERSHOOT_CONFIG_TX_UNDERSHOOT_PROT_ENABLE_POS                                               (0U)
#define TX_UNDERSHOOT_CONFIG_TX_UNDERSHOOT_PROT_ENABLE_MASK                                              (0x00000001U)  /**< rw-If set to 1; the undershoot protection is enabled*/

#define TX_OVERSHOOT_CONFIG                                                                               0x15U
#define TX_OVERSHOOT_CONFIG_TX_OVERSHOOT_PATTERN_POS                                                     (16U)
#define TX_OVERSHOOT_CONFIG_TX_OVERSHOOT_PATTERN_MASK                                                    (0xFFFF0000U)  /**< rw-Overshoot pattern which is transmitted after each rising egde. */
#define TX_OVERSHOOT_CONFIG_RESERVED_POS                                                                 (5U)
#define TX_OVERSHOOT_CONFIG_RESERVED_MASK                                                                (0x0000FFE0U)  /**< r--Reserved */
#define TX_OVERSHOOT_CONFIG_TX_OVERSHOOT_PATTERN_LEN_POS                                                 (1U)
#define TX_OVERSHOOT_CONFIG_TX_OVERSHOOT_PATTERN_LEN_MASK                                                (0x0000001EU)  /**< rw-Defines length of the overshoot prevention pattern (value +1U). The pattern is applied starting from the LSB of the defined pattern; all other bits are ignored. */
#define TX_OVERSHOOT_CONFIG_TX_OVERSHOOT_PROT_ENABLE_POS                                                 (0U)
#define TX_OVERSHOOT_CONFIG_TX_OVERSHOOT_PROT_ENABLE_MASK                                                (0x00000001U)  /**< rw-If set to 1; the overshoot protection is enabled.*/

#define TX_DATA_MOD                                                                                       0x16U
#define TX_DATA_MOD_TX_DATA_MOD_WIDTH_POS                                                                (8U)
#define TX_DATA_MOD_TX_DATA_MOD_WIDTH_MASK                                                               (0x0000FF00U)  /**< rw-*/
#define TX_DATA_MOD_TX_BITPHASE_POS                                                                      (0U)
#define TX_DATA_MOD_TX_BITPHASE_MASK                                                                     (0x000000FFU)  /**< rw-Defines the number of 13.56MHz cycles used for adjustment of tx_wait to meet the FDT. */

#define TX_WAIT_CONFIG                                                                                    0x17U
#define TX_WAIT_CONFIG_TX_WAIT_VALUE_POS                                                                 (8U)
#define TX_WAIT_CONFIG_TX_WAIT_VALUE_MASK                                                                (0x0FFFFF00U)  /**< rw-Defines the tx_wait timer reload value. Note: If set to 00000h the tx_wait guard time is disabled Note: This bit is set by HW a protocol is detected in automatic mode detection*/
#define TX_WAIT_CONFIG_TX_WAIT_PRESCALER_POS                                                             (0U)
#define TX_WAIT_CONFIG_TX_WAIT_PRESCALER_MASK                                                            (0x000000FFU)  /**< rw-Defines the prescaler reload value for the tx_wait timer. Note: This bit is set by HW a protocol is  detected in automatic mode detection*/

#define TX_CONFIG                                                                                         0x18U
#define TX_CONFIG_TX_PARITY_LAST_INV_ENABLE_POS                                                          (13U)
#define TX_CONFIG_TX_PARITY_LAST_INV_ENABLE_MASK                                                         (0x00002000U)  /**< rw-If set to 1; the parity bit of last sent data byte is inverted */
#define TX_CONFIG_TX_PARITY_TYPE_POS                                                                     (12U)
#define TX_CONFIG_TX_PARITY_TYPE_MASK                                                                    (0x00001000U)  /**< rw-Defines the type of the parity bit 0 Even Parity is calculated 1 Odd parity is calculated       */
#define TX_CONFIG_TX_PARITY_ENABLE_POS                                                                   (11U)
#define TX_CONFIG_TX_PARITY_ENABLE_MASK                                                                  (0x00000800U)  /**< rw-If set to 1; a parity bit is calculated and appended to each byte transmitted. If the Transmission Of Data Is Enabled and TX_NUM_BYTES_2_SEND is zero; then a NO_DATA_ERROR occurs. */
#define TX_CONFIG_TX_DATA_ENABLE_POS                                                                     (10U)
#define TX_CONFIG_TX_DATA_ENABLE_MASK                                                                    (0x00000400U)  /**< rw-If set to 1; transmission of data is enabled otherwise only symbols are tranmitted. */
#define TX_CONFIG_TX_STOP_SYMBOL_POS                                                                     (8U)
#define TX_CONFIG_TX_STOP_SYMBOL_MASK                                                                    (0x00000300U)  /**< rw-Defines which pattern symbol is sent as frame stop-symbol 00b No symbol is sent 01b Symbol1 is sent 10b Symbol2 is sent 11b Symbol3 is sent */
#define TX_CONFIG_TX_START_SYMBOL_POS                                                                    (6U)
#define TX_CONFIG_TX_START_SYMBOL_MASK                                                                   (0x000000C0U)  /**< rw-Defines which symbol pattern is sent as frame start-symbol 00b No symbol pattern is sent 01b Symbol0 is sent 10b Symbol1 is sent 11b Symbol2 is sent*/
#define TX_CONFIG_TX_LAST_BITS_POS                                                                       (3U)
#define TX_CONFIG_TX_LAST_BITS_MASK                                                                      (0x00000038U)  /**< rw-Defines how many bits of the last data byte to be sent. If set to 000b all bits of the last data byte are sent. Note: Bits are skipped at the end of the byte */
#define TX_CONFIG_TX_FIRST_BITS_POS                                                                      (0U)
#define TX_CONFIG_TX_FIRST_BITS_MASK                                                                     (0x00000007U)  /**< rw-Defines how many bits of the first data byte to be sent. If set to 000b all bits of the last data byte are sent. Note: Bits are skipped at the beginning of the byte */

#define CRC_TX_CONFIG                                                                                     0x19U
#define CRC_TX_CONFIG_TX_CRC_PRESET_VALUE_POS                                                            (16U)
#define CRC_TX_CONFIG_TX_CRC_PRESET_VALUE_MASK                                                           (0xFFFF0000U)  /**< rw-Arbitrary preset value for the Tx-Encoder CRC calculation. */
#define CRC_TX_CONFIG_RESERVED_POS                                                                       (7U)
#define CRC_TX_CONFIG_RESERVED_MASK                                                                      (0x0000FF80U)  /**< r--Reserved */
#define CRC_TX_CONFIG_TX_CRC_BYTE2_ENABLE_POS                                                            (6U)
#define CRC_TX_CONFIG_TX_CRC_BYTE2_ENABLE_MASK                                                           (0x00000040U)  /**< rw-If set; the CRC is calculated from the 2nd byte onwards (intended for HID). Note that this option is used in the Tx-Encoder.           */
#define CRC_TX_CONFIG_TX_CRC_PRESET_SEL_POS                                                              (3U)
#define CRC_TX_CONFIG_TX_CRC_PRESET_SEL_MASK                                                             (0x00000038U)  /**< rw-Preset value of the CRC register for the Tx-Encoder. For a CRC calculation using 5bits; only the LSByte is used. 000b* 0000h; reset value 001b  6363h 010b A671h 011b  FFFFh 100b 0012h 101b E012h 110b RFU 111b Use arbitrary preset value TX_CRC_PRESET_VALUE*/
#define CRC_TX_CONFIG_TX_CRC_TYPE_POS                                                                    (2U)
#define CRC_TX_CONFIG_TX_CRC_TYPE_MASK                                                                   (0x00000004U)  /**< rw-Controls the type of CRC calulation for the Tx-Encoder 0* 16bit CRC calculation; reset value 1 5bit CRC calculation */
#define CRC_TX_CONFIG_TX_CRC_INV_POS                                                                     (1U)
#define CRC_TX_CONFIG_TX_CRC_INV_MASK                                                                    (0x00000002U)  /**< rw-Controls the sending of an inverted CRC value by the Tx-Encoder 0* Not inverted CRC checksum; reset value 1 Inverted CRC checksum */
#define CRC_TX_CONFIG_TX_CRC_ENABLE_POS                                                                  (0U)
#define CRC_TX_CONFIG_TX_CRC_ENABLE_MASK                                                                 (0x00000001U)  /**< rw-If set to one; the Tx-Encoder will compute and transmit a CRC.*/

#define SIGPRO_CONFIG                                                                                     0x1AU
#define SIGPRO_CONFIG_BAUDRATE_POS                                                                       (0U)
#define SIGPRO_CONFIG_BAUDRATE_MASK                                                                      (0x00000007U)  /**< rw-Defines the baudrate of the receiving signal. The MSB is only relevent for reader mode. Note: These bits are set by the mode-detector if automatic mode detection is enabled and the communication mode is detected. 000* RFU 001 RFU 010 26kBd (only for reader mode) 011 53kBd (only for reader mode) 100 106kBd Note that this configuration is set by the Mode detector for ISO14443 type A and B. 101 212kBd Note that this configuration is set by the Mode detector for FeliCa 212kBd. 110 424kBd Note that this configuration is set by the Mode detector for FeliCa 424kBd. 111 848kBd*/

#define SIGPRO_CM_CONFIG                                                                                  0x1BU
#define SIGPRO_CM_CONFIG_RX_FRAMING_POS                                                                  (29U)
#define SIGPRO_CM_CONFIG_RX_FRAMING_MASK                                                                 (0x60000000U)  /**< rw-Defines the framing in card mode. Note that these bits are set by the mod-detector if automatic mode detection is enabled and the communication mode is detected. 00* ISO14443-3 TypeA 01 ISO18092 (NFC - with Syncbyte 0xF0) 10 FeliCa 11 ISO14443B*/
#define SIGPRO_CM_CONFIG_EDGE_DETECT_TAP_SEL_POS                                                         (26U)
#define SIGPRO_CM_CONFIG_EDGE_DETECT_TAP_SEL_MASK                                                        (0x1C000000U)  /**< rw-Selects the number of taps of the edge-detector filter. 000* Edge detector filter with 4 taps 001 Edge detector filter with 6 taps 010 Edge detector filter with 8 taps  4             011 Edge detector filter with 12 taps 100 Edge detector filter with 16 taps 101 Edge detector filter with 18 taps 110 Edge detector filter with 24 taps 111 Edge detector filter with 32 taps */
#define SIGPRO_CM_CONFIG_EDGE_DETECT_TH_POS                                                              (13U)
#define SIGPRO_CM_CONFIG_EDGE_DETECT_TH_MASK                                                             (0x03FFE000U)  /**< rw-Threshold for the edge decision block of the ADCBCM. */
#define SIGPRO_CM_CONFIG_BIT_DETECT_TH_POS                                                               (0U)
#define SIGPRO_CM_CONFIG_BIT_DETECT_TH_MASK                                                              (0x00001FFFU)  /**< rw-Threshold for the "bit" decision block of the ADCBCM.*/

#define SIGPRO_RM_CONFIG                                                                                  0x1CU
#define SIGPRO_RM_CONFIG_BPSK_IQ_MODE_POS                                                                (21U)
#define SIGPRO_RM_CONFIG_BPSK_IQ_MODE_MASK                                                               (0x00E00000U)  /**< rw-Defines strategy of signal processing regarding I and Q channel    000* Both channels (I and Q) are used for signal processing  001 Use only I channel   010 Use only Q channel   011 RFU   100 Use the strongest channel    101 Use the first channel   110-111 RFU*/
#define SIGPRO_RM_CONFIG_BPSK_FILT6_POS                                                                  (20U)
#define SIGPRO_RM_CONFIG_BPSK_FILT6_MASK                                                                 (0x00100000U)  /**< rw-This bit changes the Spike filter for the Phaseshift detection from order 5 to order 6 (default = order 6).*/
#define SIGPRO_RM_CONFIG_RESYNC_EQ_ON_POS                                                                (19U)
#define SIGPRO_RM_CONFIG_RESYNC_EQ_ON_MASK                                                               (0x00080000U)  /**< rw-Resynchronisaton during the SOF for an equal correlation value is done (default = activated).*/
#define SIGPRO_RM_CONFIG_CORR_RESET_ON_POS                                                               (18U)
#define SIGPRO_RM_CONFIG_CORR_RESET_ON_MASK                                                              (0x00040000U)  /**< rw-The correclator is reset at a reset (default = activated).*/
#define SIGPRO_RM_CONFIG_VALID_FILT_OFF_POS                                                              (17U)
#define SIGPRO_RM_CONFIG_VALID_FILT_OFF_MASK                                                             (0x00020000U)  /**< rw-Disables a special filter in BPSK mode. If set to 0, the correlation of 0110 is filtered with the correlation of 1110 and 0111. Otherwise the demodulation is done using the correlation with 0110*/
#define SIGPRO_RM_CONFIG_DATA_BEFORE_MIN_POS                                                             (16U)
#define SIGPRO_RM_CONFIG_DATA_BEFORE_MIN_MASK                                                            (0x00010000U)  /**< rw-Data is received even before the first minimum at the SOF (default: = deactivated).*/
#define SIGPRO_RM_CONFIG_MIN_LEVEL_POS                                                                   (12U)
#define SIGPRO_RM_CONFIG_MIN_LEVEL_MASK                                                                  (0x0000F000U)  /**< rw-Defines the MinLevel of the reception Note: The MinLevel should be higher than the noise level in the system Note: Used for BPSK and Manchester with Subcarrier communication types as MinLevel! */
#define SIGPRO_RM_CONFIG_MIN_LEVEL_P_POS                                                                 (8U)
#define SIGPRO_RM_CONFIG_MIN_LEVEL_P_MASK                                                                (0x00000F00U)  /**< rw-Defines the minlevel for the phaseshift detector unit */
#define SIGPRO_RM_CONFIG_USE_SMALL_EVAL_POS                                                              (7U)
#define SIGPRO_RM_CONFIG_USE_SMALL_EVAL_MASK                                                             (0x00000080U)  /**< rw-Defines the length of the eval periode for the correlator for Manchester subcarrier communication types. */
#define SIGPRO_RM_CONFIG_COLL_LEVEL_POS                                                                  (5U)
#define SIGPRO_RM_CONFIG_COLL_LEVEL_MASK                                                                 (0x00000060U)  /**< rw-Defines how strong a signal must be to be interpreded as a collision for Manchester subcarrier communication types. 00* >12U;5% 01 >25% 10 >50% No Collison */
#define SIGPRO_RM_CONFIG_PRE_FILTER_POS                                                                  (4U)
#define SIGPRO_RM_CONFIG_PRE_FILTER_MASK                                                                 (0x00000010U)  /**< rw-If set to 1 four samples are combined to one data. (average) */
#define SIGPRO_RM_CONFIG_RECT_FILTER_POS                                                                 (3U)
#define SIGPRO_RM_CONFIG_RECT_FILTER_MASK                                                                (0x00000008U)  /**< rw-If set to one; the ADC-values are changed to a more rectangular waveshape. */
#define SIGPRO_RM_CONFIG_SYNC_HIGH_POS                                                                   (2U)
#define SIGPRO_RM_CONFIG_SYNC_HIGH_MASK                                                                  (0x00000004U)  /**< rw-Defines if the bitgrid is fixed at maximum (1) or at a minimum(0) value of the correlation. */
#define SIGPRO_RM_CONFIG_FSK_POS                                                                         (1U)
#define SIGPRO_RM_CONFIG_FSK_MASK                                                                        (0x00000002U)  /**< rw-If set to 1; the demodulation scheme is FSK. */
#define SIGPRO_RM_CONFIG_BPSK_POS                                                                        (0U)
#define SIGPRO_RM_CONFIG_BPSK_MASK                                                                       (0x00000001U)  /**< rw-If set to 1, the demodulation scheme is BPSK.*/

