Gloryfy/NFC/NfcdlibEx1_BasicDiscLoop_s32k118/NxpNfcRdLib/intfs/phhalHw_Ncx3330_Reg.h
#define TRANSCEIVER_CONFIG_RFU                                                                            0x2AU
#define TRANSCEIVER_CONFIG_RFU_TX_WAIT_RFON_ENABLE_POS                                                   (2U)
#define TRANSCEIVER_CONFIG_RFU_TX_WAIT_RFON_ENABLE_MASK                                                  (0x00000004U)  /**< rw-If set to 1 the TxWait guard time will be started when the own RF-Field is switched on. Note: In default configuration the TxWait guard time is started at the end of reception. This feature is intended to be used for NFC-Active communication */
#define TRANSCEIVER_CONFIG_RFU_RX_WAIT_RFON_ENABLE_POS                                                   (1U)
#define TRANSCEIVER_CONFIG_RFU_RX_WAIT_RFON_ENABLE_MASK                                                  (0x00000002U)  /**< rw-If set to 1 the RxWait guard time will be started when the own RF-Field is switched off and an external RF-Field was detected. Note: In default configuration the RxWait guard time is started at the end of transmission. This feature is intended to be used for NFC-Active communication */
#define TRANSCEIVER_CONFIG_RFU_TX_MILLER_SYNC_ENABLE_POS                                                 (0U)
#define TRANSCEIVER_CONFIG_RFU_TX_MILLER_SYNC_ENABLE_MASK                                                (0x00000001U)  /**< rw-If set to 1 guard time is synchronized to miller envelope for transmission. Used for AGC.*/

#define AGC_CONFIG0_RFU                                                                                   0x2BU
#define AGC_CONFIG0_RFU_AGC_TESTMODE_ENABLE_POS                                                          (17U)
#define AGC_CONFIG0_RFU_AGC_TESTMODE_ENABLE_MASK                                                         (0x00020000U)  /**< rw-If this bit is set, then the AGC value is increased/decreased by signals form the testbus. Note that this bit is shall never be set by FW and is intended only for test-purposes.*/
#define AGC_CONFIG0_RFU_MILLER_BG_FREEZE_VALUE_POS                                                       (10U)
#define AGC_CONFIG0_RFU_MILLER_BG_FREEZE_VALUE_MASK                                                      (0x0001FC00U)  /**< rw-This bit is primarily intended to achieve AGC operation in RM for ISO14443 type A 106kBd (AGC_FREEZE_ON_MILLER_BG). However, this field is also re-used for the back-up modes AGC_FREEZE_ON_RX_WAIT and AGC_FAST_MODE_RX_WAIT.*/
#define AGC_CONFIG0_RFU_AGC_THRESHOLD_POS                                                                (1U)
#define AGC_CONFIG0_RFU_AGC_THRESHOLD_MASK                                                               (0x000003FEU)  /**< rw-Defines the threshold value for the AGC. Value must not be larger than AGC_TIME_CONSTANT>>1 - 1.*/
#define AGC_CONFIG0_RFU_AGC_SYNC_COMP_DISABLE_POS                                                        (0U)
#define AGC_CONFIG0_RFU_AGC_SYNC_COMP_DISABLE_MASK                                                       (0x00000001U)  /**< rw-If set, the synchronization register at the input of the digital controller to synchronize agc_comp_ai is by-passed.*/

#define AGC_CONFIG1_RFU                                                                                   0x2CU
#define AGC_CONFIG1_RFU_AGC_RF_DETECT_SEL_POS                                                            (29U)
#define AGC_CONFIG1_RFU_AGC_RF_DETECT_SEL_MASK                                                           (0x60000000U)  /**< rw-Selects/enables the RF-off detection during transmission (intended for SL-ALM). If enabled, the AGC reference voltage is set to its minimum (0x00)*/
#define AGC_CONFIG1_RFU_AGC_FREEZE_TX_SWITCH_VALUE_POS                                                   (28U)
#define AGC_CONFIG1_RFU_AGC_FREEZE_TX_SWITCH_VALUE_MASK                                                  (0x10000000U)  /**< rw-If set, the internal AGC is frozen during transmission and the output value is switched with the tx-envelope between the CM value (env=0) (CLIF_AGC_INPUT_REG.AGC_CM_VALUE) and the RM value (env=1) (CLIF_AGC_INPUT_REG.AGC_RM_VALUE).*/
#define AGC_CONFIG1_RFU_AGC_MAX_TXRFOFF_ENABLE_POS                                                       (27U)
#define AGC_CONFIG1_RFU_AGC_MAX_TXRFOFF_ENABLE_MASK                                                      (0x08000000U)  /**< rw-If set, the AGC is forced to maximum value for a given time period after the devices' RF-Field was switched off.*/
#define AGC_CONFIG1_RFU_AGC_MASK_DURATION_POS                                                            (21U)
#define AGC_CONFIG1_RFU_AGC_MASK_DURATION_MASK                                                           (0x07E00000U)  /**< rw-Number of RF cycles the AGC active signal is set after each AGC update. In RM the signal masks out the preamble detection in the SigPro RM. In CM the signal masks out the data signals in the SigPro during Fast-Mode. In case AGC_MASK_DURATION is set to zero, the agc_active_o signal is not set.*/
#define AGC_CONFIG1_RFU_AGC_FREEZE_RESET_ON_RF_OFF_POS                                                   (20U)
#define AGC_CONFIG1_RFU_AGC_FREEZE_RESET_ON_RF_OFF_MASK                                                  (0x00100000U)  /**< rw-If set, the AGC is reset to zero when an external field vanishes and frozen (as long as no external field is present).*/
#define AGC_CONFIG1_RFU_AGC_FREEZE_ON_MILLER_BG_POS                                                      (19U)
#define AGC_CONFIG1_RFU_AGC_FREEZE_ON_MILLER_BG_MASK                                                     (0x00080000U)  /**< rw-If set, the AGC is frozen, when the bit-grid value is below the value in MILLER_BG_FREEZE_VALUE.*/
#define AGC_CONFIG1_RFU_AGC_FREEZE_ON_SOF_DETECTED_POS                                                   (18U)
#define AGC_CONFIG1_RFU_AGC_FREEZE_ON_SOF_DETECTED_MASK                                                  (0x00040000U)  /**< rw-If rm_startbit_detected_i is set (SOF detected by the SigPro), the AGC is frozen.*/
#define AGC_CONFIG1_RFU_AGC_FREEZE_ON_DPRESENT_POS                                                       (17U)
#define AGC_CONFIG1_RFU_AGC_FREEZE_ON_DPRESENT_MASK                                                      (0x00020000U)  /**< rw-If rm_dpresent_i is set (preamble detected by the SigPro), the AGC is frozen.*/
#define AGC_CONFIG1_RFU_AGC_FREEZE_ON_DPRESENT_NEXT_POS                                                  (16U)
#define AGC_CONFIG1_RFU_AGC_FREEZE_ON_DPRESENT_NEXT_MASK                                                 (0x00010000U)  /**< rw-If rm_dpresent_next_i is set (preamble detected by the SigPro), the AGC is frozen.*/
#define AGC_CONFIG1_RFU_AGC_FREEZE_ON_RXWAIT_OFF_POS                                                     (15U)
#define AGC_CONFIG1_RFU_AGC_FREEZE_ON_RXWAIT_OFF_MASK                                                    (0x00008000U)  /**< rw-If rx_wait_i is not set, the AGC is frozen.*/
#define AGC_CONFIG1_RFU_AGC_FAST_MODE_DURATION_POS                                                       (5U)
#define AGC_CONFIG1_RFU_AGC_FAST_MODE_DURATION_MASK                                                      (0x00007FE0U)  /**< rw-Duration of the Fast-Mode in multiples of RF clock cycles (clk13).*/
#define AGC_CONFIG1_RFU_AGC_FAST_MODE_RFON_EXT_POS                                                       (4U)
#define AGC_CONFIG1_RFU_AGC_FAST_MODE_RFON_EXT_MASK                                                      (0x00000010U)  /**< rw-If set the AGC enters fast mode (HW sets AGC_FAST_MODE_ENABLE) when an external RF field is detected.*/
#define AGC_CONFIG1_RFU_AGC_FAST_MODE_TX_OVER_POS                                                        (3U)
#define AGC_CONFIG1_RFU_AGC_FAST_MODE_TX_OVER_MASK                                                       (0x00000008U)  /**< rw-If set to one, the AGC fast-mode (i.e. time-constant "1" and step size given by AGC_FAST_MODE_STEP) is enabled for AGC_FAST_MODE_DURATION clk13 cycles after transmission*/
#define AGC_CONFIG1_RFU_AGC_FAST_MODE_STEP_POS                                                           (1U)
#define AGC_CONFIG1_RFU_AGC_FAST_MODE_STEP_MASK                                                          (0x00000006U)  /**< rw-Step size of the AGC in fast-mode: 0* Step by one 1 Step by two 2 Step by three 3 Step by four*/
#define AGC_CONFIG1_RFU_AGC_FAST_MODE_ENABLE_POS                                                         (0U)
#define AGC_CONFIG1_RFU_AGC_FAST_MODE_ENABLE_MASK                                                        (0x00000001U)  /**< rw-If set to one, the AGC fast-mode (i.e. time-constant "1" and step size given by AGC_FAST_MODE_STEP) is enabled for AGC_FAST_MODE_DURATION clk13 cycles.*/

#define ANA_RX_RFU                                                                                        0x2DU
#define ANA_RX_RFU_RX_VMID_RSEL_POS                                                                      (2U)
#define ANA_RX_RFU_RX_VMID_RSEL_MASK                                                                     (0x0000000CU)  /**< rw-Selection of resistance between VDD and VSS: 00->1.4k; 01->2.8k, 10->5.7k, 11->11k*/
#define ANA_RX_RFU_RX_SHORT_MIX2ADC_POS                                                                  (1U)
#define ANA_RX_RFU_RX_SHORT_MIX2ADC_MASK                                                                 (0x00000002U)  /**< rw-Short Mixer to ADC, I and Q*/
#define ANA_RX_RFU_RX_OC_ENABLE_POS                                                                      (0U)
#define ANA_RX_RFU_RX_OC_ENABLE_MASK                                                                     (0x00000001U)  /**< rw-Offset Compensation BBA*/

#define ANA_RX_POWER_CONTROL_RFU                                                                          0x2EU
#define ANA_RX_POWER_CONTROL_RFU_CM_PD_MILLER_POS                                                        (9U)
#define ANA_RX_POWER_CONTROL_RFU_CM_PD_MILLER_MASK                                                       (0x00000200U)  /**< rw-Power Down CM reference based miller demodulator*/
#define ANA_RX_POWER_CONTROL_RFU_CM_PD_CLKREC_POS                                                        (8U)
#define ANA_RX_POWER_CONTROL_RFU_CM_PD_CLKREC_MASK                                                       (0x00000100U)  /**< rw-Power Down CM clock recovery*/
#define ANA_RX_POWER_CONTROL_RFU_CM_PD_DLL_POS                                                           (7U)
#define ANA_RX_POWER_CONTROL_RFU_CM_PD_DLL_MASK                                                          (0x00000080U)  /**< rw-Power Down CM delay lock loop (DLL)*/
#define ANA_RX_POWER_CONTROL_RFU_CM_PD_DLL_CP_POS                                                        (6U)
#define ANA_RX_POWER_CONTROL_RFU_CM_PD_DLL_CP_MASK                                                       (0x00000040U)  /**< rw-Power Down CM charge pump (inside DLL)*/
#define ANA_RX_POWER_CONTROL_RFU_RX_PD_ADC_Q_POS                                                         (5U)
#define ANA_RX_POWER_CONTROL_RFU_RX_PD_ADC_Q_MASK                                                        (0x00000020U)  /**< rw-Power Down ADC Q-channel*/
#define ANA_RX_POWER_CONTROL_RFU_RX_PD_ADC_I_POS                                                         (4U)
#define ANA_RX_POWER_CONTROL_RFU_RX_PD_ADC_I_MASK                                                        (0x00000010U)  /**< rw-Power Down ADC I-channel*/
#define ANA_RX_POWER_CONTROL_RFU_RX_PD_BBA_BIAS_POS                                                      (3U)
#define ANA_RX_POWER_CONTROL_RFU_RX_PD_BBA_BIAS_MASK                                                     (0x00000008U)  /**< rw-Power Down Baseband Amplifier Bias Block*/
#define ANA_RX_POWER_CONTROL_RFU_RX_PD_BBA_Q_POS                                                         (2U)
#define ANA_RX_POWER_CONTROL_RFU_RX_PD_BBA_Q_MASK                                                        (0x00000004U)  /**< rw-Power Down Baseband Amplifier Q-Channel*/
#define ANA_RX_POWER_CONTROL_RFU_RX_PD_BBA_I_POS                                                         (1U)
#define ANA_RX_POWER_CONTROL_RFU_RX_PD_BBA_I_MASK                                                        (0x00000002U)  /**< rw-Power Down Baseband Amplifier I-Channel*/
#define ANA_RX_POWER_CONTROL_RFU_RX_SHORT_MIX2BBA_ST2_POS                                                (0U)
#define ANA_RX_POWER_CONTROL_RFU_RX_SHORT_MIX2BBA_ST2_MASK                                               (0x00000001U)  /**< rw-Short Mixer to BBA Stage 2; I only*/

#define ANA_TX_CONTROL_RFU                                                                                0x2FU
#define ANA_TX_CONTROL_RFU_TX_PD_CLK_GEN_POS                                                             (1U)
#define ANA_TX_CONTROL_RFU_TX_PD_CLK_GEN_MASK                                                            (0x00000002U)  /**< rw-TX clock generation disabled and thus also envelope synchronization to clk is disabled.*/
#define ANA_TX_CONTROL_RFU_TX_ALM_BPSK_ENABLE_POS                                                        (0U)
#define ANA_TX_CONTROL_RFU_TX_ALM_BPSK_ENABLE_MASK                                                       (0x00000001U)  /**< rw-If set to 1, modulation for ALM is done with BPSK scheme on carrier*/

#define DPLL_CONTROL_RFU                                                                                  0x30U
#define DPLL_CONTROL_RFU_SINGLE_LOOP_ALM_ENABLE_POS                                                      (8U)
#define DPLL_CONTROL_RFU_SINGLE_LOOP_ALM_ENABLE_MASK                                                     (0x00000100U)  /**< rw-Enables the DPLL controller*/
#define DPLL_CONTROL_RFU_DPLL_FREEZE_ON_TX_ENV_POS                                                       (6U)
#define DPLL_CONTROL_RFU_DPLL_FREEZE_ON_TX_ENV_MASK                                                      (0x000000C0U)  /**< rw-Freeze when activly modulating (env for ALM == 1U); 'b00 = disabled, 'b01 = unfreeze as early as possible after modulation, 'b10 = unfreeze with additional medium delay after modulation (additional 3 cycles), 'b11 = do not unfreeze during subcarrier modulation (except phase  shift)*/
#define DPLL_CONTROL_RFU_DPLL_FREEZE_ON_FW_POS                                                           (5U)
#define DPLL_CONTROL_RFU_DPLL_FREEZE_ON_FW_MASK                                                          (0x00000020U)  /**< rw-Freeze initiated by FW, intended to change the gear shift settings*/
#define DPLL_CONTROL_RFU_DPLL_FREEZE_ON_ADCBCM_ACTIVE_POS                                                (4U)
#define DPLL_CONTROL_RFU_DPLL_FREEZE_ON_ADCBCM_ACTIVE_MASK                                               (0x00000010U)  /**< rw-Freezes the DPLL frequency already when the ADC based card-mode detects an envelope*/
#define DPLL_CONTROL_RFU_DPLL_FREEZE_ON_RX_POS                                                           (3U)
#define DPLL_CONTROL_RFU_DPLL_FREEZE_ON_RX_MASK                                                          (0x00000008U)  /**< rw-Freezes the DPLL frequency in RECEIVE state (as soon as the start of reception is detected)*/
#define DPLL_CONTROL_RFU_DPLL_FREEZE_ON_WAITDATA_POS                                                     (2U)
#define DPLL_CONTROL_RFU_DPLL_FREEZE_ON_WAITDATA_MASK                                                    (0x00000004U)  /**< rw-Freezes the DPLL frequency in WAIT_FOR_DATA state*/
#define DPLL_CONTROL_RFU_DPLL_RESTART_GEAR_TXWAIT_POS                                                    (1U)
#define DPLL_CONTROL_RFU_DPLL_RESTART_GEAR_TXWAIT_MASK                                                   (0x00000002U)  /**< rw-Command to restart the gear shifting at the beginning of Tx-Wait from gear zero*/
#define DPLL_CONTROL_RFU_DPLL_RESTART_GEAR_POS                                                           (0U)
#define DPLL_CONTROL_RFU_DPLL_RESTART_GEAR_MASK                                                          (0x00000001U)  /**< rw-Command to restart the gear shifting from gear zero with initial settings from CLIF_DPLL_INIT_REG*/

#define DPLL_INIT_RFU                                                                                     0x31U
#define DPLL_INIT_RFU_DPLL_WAKEUP_TIME_POS                                                               (11U)
#define DPLL_INIT_RFU_DPLL_WAKEUP_TIME_MASK                                                              (0x00001800U)  /**< rw-Duration of the Wakeup-Mode*/
#define DPLL_INIT_RFU_DPLL_WAKEUP_INT_ENABLE_POS                                                         (10U)
#define DPLL_INIT_RFU_DPLL_WAKEUP_INT_ENABLE_MASK                                                        (0x00000400U)  /**< rw-Enables the integral path of the loop-filter even in WAKEUP mode*/
#define DPLL_INIT_RFU_DPLL_WAKEUP_LF_SEL_POS                                                             (8U)
#define DPLL_INIT_RFU_DPLL_WAKEUP_LF_SEL_MASK                                                            (0x00000300U)  /**< rw-Proportional parameter of loop filter for WAKEUP mode*/
#define DPLL_INIT_RFU_DPLL_TIME_INIT_SEL_POS                                                             (6U)
#define DPLL_INIT_RFU_DPLL_TIME_INIT_SEL_MASK                                                            (0x000000C0U)  /**< rw-Initial gear duration*/
#define DPLL_INIT_RFU_DPLL_INT_INIT_SEL_POS                                                              (3U)
#define DPLL_INIT_RFU_DPLL_INT_INIT_SEL_MASK                                                             (0x00000038U)  /**< rw-Initial gear integral parameter*/
#define DPLL_INIT_RFU_DPLL_PROP_INIT_SEL_POS                                                             (0U)
#define DPLL_INIT_RFU_DPLL_PROP_INIT_SEL_MASK                                                            (0x00000007U)  /**< rw-Initial gear proportional parameter*/

#define DPLL_INIT_FREQ_RFU                                                                                0x32U
#define DPLL_INIT_FREQ_RFU_DPLL_SATURATION_ENABLE_POS                                                    (16U)
#define DPLL_INIT_FREQ_RFU_DPLL_SATURATION_ENABLE_MASK                                                   (0x00010000U)  /**< rw-If set, the integrator is saturated to DPLL_CTRL +/- 0.0546875*/
#define DPLL_INIT_FREQ_RFU_DPLL_CTRL_POS                                                                 (0U)
#define DPLL_INIT_FREQ_RFU_DPLL_CTRL_MASK                                                                (0x0000FFFFU)  /**< rw-The initial DPLL integrator value, i.e., the nominal post-divider value. Note: This value is loaded into the DPLL in the first cycle the DPLL controller enables the DPLL (refer to CLIF_DPLL_INIT_REG.SINGLE_LOOP_ALM_ENABLE). Note: It is not allowed to change this value during DPLL operation, because the limits (convergence range) is derived from it*/

