Gloryfy/NFC/NfcdlibEx1_BasicDiscLoop_s32k118/NxpNfcRdLib/intfs/phhalHw_Ncx3330_Reg.h
#define RX_CONFIG_REG_RFU                                                                                 0x3AU
#define RX_CONFIG_REG_RFU_RX_PARITY_EMD_ON_SOVER_POS                                                     (29U)
#define RX_CONFIG_REG_RFU_RX_PARITY_EMD_ON_SOVER_MASK                                                    (0x20000000U)  /**< rw-If set, decision if EMD due to parity error is
taken at sover*/
#define RX_CONFIG_REG_RFU_RX_MISSING_PARITY_IS_EMD_POS                                                   (28U)
#define RX_CONFIG_REG_RFU_RX_MISSING_PARITY_IS_EMD_MASK                                                  (0x10000000U)  /**< rw-If set, a missing parity bit in the 4th byte is treated as
EMD (for EMD option 3/4*/
#define RX_CONFIG_REG_RFU_RX_ADVANCED_EMD_ENABLE_POS                                                     (27U)
#define RX_CONFIG_REG_RFU_RX_ADVANCED_EMD_ENABLE_MASK                                                    (0x08000000U)  /**< rw-If set, new EMD options for PN548 are enabled*/
#define RX_CONFIG_REG_RFU_RX_PARITY_ERROR_IS_EMD_POS                                                     (26U)
#define RX_CONFIG_REG_RFU_RX_PARITY_ERROR_IS_EMD_MASK                                                    (0x04000000U)  /**< rw-If set to 1 a parity error in the 3rd/4th byte (depending on RX_EMD_SUP setting) is interpreted as an EMD error. Otherwise it is interpreted as a parity error.*/
#define RX_CONFIG_REG_RFU_RX_EMD_SUP_POS                                                                 (23U)
#define RX_CONFIG_REG_RFU_RX_EMD_SUP_MASK                                                                (0x03800000U)  /**< rw-Defines EMD suppression mechanism 000 Off 001 EMD suppression according to ISO14443 010 EMD suppression according to NFC Forum (with respect to the first 3 characters) 011 EMD suppression according to NFC Forum (with respect to the first 4characters) 100 EMD suppression according to NFC Forum (with respect to the first 4characters, all valid frames <4 bytes are ignored) 101-111 RFU*/
#define RX_CONFIG_REG_RFU_RX_COLL_IS_DATA_ERROR_POS                                                      (22U)
#define RX_CONFIG_REG_RFU_RX_COLL_IS_DATA_ERROR_MASK                                                     (0x00400000U)  /**< rw-If set to 1; a collision is treated as a data integrity error (especially for ISO14443-4) */
#define RX_CONFIG_REG_RFU_RESERVED_POS                                                                   (21U)
#define RX_CONFIG_REG_RFU_RESERVED_MASK                                                                  (0x00200000U)  /**< r--*/
#define RX_CONFIG_REG_RFU_RX_CRC_ALLOW_BITS_POS                                                          (20U)
#define RX_CONFIG_REG_RFU_RX_CRC_ALLOW_BITS_MASK                                                         (0x00100000U)  /**< rw-Set to 1; a frame with less than one byte length is writtten to ram; when the CRC is enabled otherwise it is discarted. */
#define RX_CONFIG_REG_RFU_RX_FORCE_CRC_WRITE_POS                                                         (19U)
#define RX_CONFIG_REG_RFU_RX_FORCE_CRC_WRITE_MASK                                                        (0x00080000U)  /**< rw-Set to 1; the received CRC byte(s) are written to ram. In normal operation (if this bit is set to 0) CRC bytes are only checked and removed from the data stream. */
#define RX_CONFIG_REG_RFU_RX_PARITY_ERR_8BITS_ENABLE_POS                                                 (18U)
#define RX_CONFIG_REG_RFU_RX_PARITY_ERR_8BITS_ENABLE_MASK                                                (0x00040000U)  /**< rw-If set, parity error is detected when only 8 bits in last byte received*/
#define RX_CONFIG_REG_RFU_RESERVED1_POS                                                                   (15U)
#define RX_CONFIG_REG_RFU_RESERVED1_MASK                                                                  (0x00038000U)  /**< r--*/
#define RX_CONFIG_REG_RFU_RX_EOF_SYMBOL_POS                                                              (7U)
#define RX_CONFIG_REG_RFU_RX_EOF_SYMBOL_MASK                                                             (0x00007F80U)  /**< rw-This value defines the pattern of the EOF symbol. Note: All bits are clear upon enabling of the receiver is the automatic mode detection is enabled. If in such a case an ISO14443A communication is detected bit0 is set by the mod-detector. */
#define RX_CONFIG_REG_RFU_RX_EOF_TYPE_POS                                                                (6U)
#define RX_CONFIG_REG_RFU_RX_EOF_TYPE_MASK                                                               (0x00000040U)  /**< rw-Defines the EOF handling 0 EOF as defined in the register field RX_EOF_SYMBOL is expected. 1 EOF as defined in ISO14443B is expected. */
#define RX_CONFIG_REG_RFU_RX_STOP_CONDITION_POS                                                          (4U)
#define RX_CONFIG_REG_RFU_RX_STOP_CONDITION_MASK                                                         (0x00000030U)  /**< rw-This bit field defines the condition to stop a reception. Note: This bit is set by the mod-detector if automatic mode detection is enabled and the corresponding communication is detected. 00b Reception is stopped only if end of data communication is detected by the signal processing 01b Reception is stopped upon reception of the EOF pattern selected by the register field RX_EOF_TYPE and RX_EOF_SYMBOL Note: This value is set by the mod-detector if a ISO14443A or ISO14443B communication is detected 10b Reception is stopped on detection of an incorrect parity bit. 11b Recption is stopped if the number of received bytes reaches the defined frame length (which extracted from the first data-byte received). Note: This value is set by the mod-detector if a FeliCa communication is detected */
#define RX_CONFIG_REG_RFU_RX_MSB_FIRST_POS                                                               (3U)
#define RX_CONFIG_REG_RFU_RX_MSB_FIRST_MASK                                                              (0x00000008U)  /**< rw-If set to 1; data bytes are interpreted MSB first for reception */
#define RX_CONFIG_REG_RFU_RX_STOPBIT_ENABLE_POS                                                          (2U)
#define RX_CONFIG_REG_RFU_RX_STOPBIT_ENABLE_MASK                                                         (0x00000004U)  /**< rw-Set to 1; a stop-bit is expected and will be checked and extracted from data stream. Note: The stop-bit is not configurable and fixed to a logic 1. Note: This bit is set by the mod-detector if automatic mode detection is enabled and ISO14443B communication is detected.*/
#define RX_CONFIG_REG_RFU_RESERVED2_POS                                                                   (0U)
#define RX_CONFIG_REG_RFU_RESERVED2_MASK                                                                  (0x00000003U)  /**< r--*/

