Gloryfy/NFC/NfcdlibEx1_BasicDiscLoop_s32k118/NxpNfcRdLib/intfs/phhalHw_Ncx3330_Reg.h
#define TX_DATA_MOD_RFU                                                                                   0x3BU
#define TX_DATA_MOD_RFU_TX_DATA_MILLER_ENABLE_POS                                                        (8U)
#define TX_DATA_MOD_RFU_TX_DATA_MILLER_ENABLE_MASK                                                       (0x00000100U)  /**< rw-If set to 1, pulse modulation is applied according to modified miller coding*/
#define TX_DATA_MOD_RFU_TX_DATA_INV_ENV_POS                                                              (7U)
#define TX_DATA_MOD_RFU_TX_DATA_INV_ENV_MASK                                                             (0x00000080U)  /**< rw-If set to 1, the output envelope is inverted*/
#define TX_DATA_MOD_RFU_TX_DATA_ENV_TYPE_POS                                                             (4U)
#define TX_DATA_MOD_RFU_TX_DATA_ENV_TYPE_MASK                                                            (0x00000070U)  /**< rw-Specifies the type of envelope used for transmission of data packets. The selected envelope type is applied to the pseudo bit stream. 000b Direct output 001b Manchester code 010b Manchster code with subcarrier 011b BPSK 100b RZ (pulse of half bit length at beginning of second half of bit) 101b RZ (pulse of half bit length at beginning of bit) 110b Manchester tupple coding 111b RFU*/
#define TX_DATA_MOD_RFU_TX_DATA_SC_FREQ_POS                                                              (3U)
#define TX_DATA_MOD_RFU_TX_DATA_SC_FREQ_MASK                                                             (0x00000008U)  /**< rw-Specifies the frequency of the subcarrier. 0 424 kHz 1 848 kHz*/
#define TX_DATA_MOD_RFU_TX_DATA_BIT_FREQ_POS                                                             (0U)
#define TX_DATA_MOD_RFU_TX_DATA_BIT_FREQ_MASK                                                            (0x00000007U)  /**< rw-Specifies the frequency of the bit-stream.  000b -> 1.695 MHz; 001b -> Reserved; 010b -> 26 kHz; 011b -> 53 kHz; 100b -> 106 kHz; 101b -> 212 kHz; 110b -> 424 kHz; 111b -> 848 kHz;*/

#define TX_FRAME_CONFIG_RFU                                                                               0x3CU
#define TX_FRAME_CONFIG_RFU_TX_DATA_CODE_TYPE_POS                                                        (13U)
#define TX_FRAME_CONFIG_RFU_TX_DATA_CODE_TYPE_MASK                                                       (0x0000E000U)  /**< rw-Specifies the type of encoding of data to be used 000b No special code 001b 1 out of 4 code [I-Code SLI] 010b 1 out of 256 code [I-Code SLI] 011b Pulse interval encoding (PIE) [I-Code EPC-V2] 100b 2bit tuple code (intended only for test purpose) 101-111b Reserved */
#define TX_FRAME_CONFIG_RFU_TX_STOPBIT_TYPE_POS                                                          (10U)
#define TX_FRAME_CONFIG_RFU_TX_STOPBIT_TYPE_MASK                                                         (0x00001C00U)  /**< rw-Enables the stop bit (logic "1") and extra guard time (logic "1"). The value 0 disables transmission of stop-bits. 000b no stop-bit; no EGT 001b stop-bit; no EGT 010b stop-bit + 1 EGT 011b stop-bit + 2 EGT 100b stop-bit + 3 EGT 101b stop-bit + 4 EGT 110b stop-bit + 5 EGT 111b stop-bit + 6 EGT */
#define TX_FRAME_CONFIG_RFU_TX_STARTBIT_ENABLE_POS                                                       (9U)
#define TX_FRAME_CONFIG_RFU_TX_STARTBIT_ENABLE_MASK                                                      (0x00000200U)  /**< rw-If set to 1; a start-bit (logic "0") will be send */
#define TX_FRAME_CONFIG_RFU_TX_MSB_FIRST_POS                                                             (8U)
#define TX_FRAME_CONFIG_RFU_TX_MSB_FIRST_MASK                                                            (0x00000100U)  /**< rw-If set to 1; data bytes are interpreted MSB first for data transmission */
#define TX_FRAME_CONFIG_RFU_RESERVED_POS                                                                 (0U)
#define TX_FRAME_CONFIG_RFU_RESERVED_MASK                                                                (0x000000FFU)  /**< r--*/

#define TX_SYMBOL_CONFIG_RFU                                                                              0x3DU
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL1_BURST_LEN_POS                                                    (26U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL1_BURST_LEN_MASK                                                   (0x3C000000U)  /**< rw-Specifies the number of bits issued for symbol 1 burst. The 3 bits encode a range from 8 to 256 bit length: 0000b 8 bit 0001b 12 bit 0010b 16 bit 0011b 24 bit 0100b 32 bit 0101b 40 bit 0110b 48 bit 0111b 64 bit 1000b 80 bit 1001b 96 bit 1010b 112 bit 1011b 128 bit 1100b 160 bit 1101b 192 bit 1110b 224 bit 1111b 256 bit*/
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL1_BURST_TYPE_POS                                                   (25U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL1_BURST_TYPE_MASK                                                  (0x02000000U)  /**< rw-Specifies the type of the burst of Symbol1 (logical zero / logical one) */
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL1_BURST_ONLY_POS                                                   (24U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL1_BURST_ONLY_MASK                                                  (0x01000000U)  /**< rw-If set to 1; Symbol1 consists only of a burst and no symbol pattern */
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL1_BURST_ENABLE_POS                                                 (23U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL1_BURST_ENABLE_MASK                                                (0x00800000U)  /**< rw-If set to 1; the burst of Symbol0 of the length defined in bit field SYMBOL1_BURST_LEN is enabled         */
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL0_BURST_LEN_POS                                                    (19U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL0_BURST_LEN_MASK                                                   (0x00780000U)  /**< rw-Specifies the number of bits issued for symbol 0 burst. The 3 bits encode a range from 8 to 256 bit length: 0000b 8 bit 0001b 12 bit 0010b 16 bit 0011b 24 bit 0100b 32 bit 0101b 40 bit 0110b 48 bit 0111b 64 bit 1000b 80 bit 1001b 96 bit 1010b 112 bit 1011b 128 bit 1100b 160 bit 1101b 192 bit 1110b 224 bit 1111b 256 bit*/
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL0_BURST_TYPE_POS                                                   (18U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL0_BURST_TYPE_MASK                                                  (0x00040000U)  /**< rw-Specifies the type of the burst of Symbol0 (logical zero / logical one) */
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL0_BURST_ONLY_POS                                                   (17U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL0_BURST_ONLY_MASK                                                  (0x00020000U)  /**< rw-If set to 1; Symbol0 consists only of a burst and no symbol pattern */
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL0_BURST_ENABLE_POS                                                 (16U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL0_BURST_ENABLE_MASK                                                (0x00010000U)  /**< rw-If set to 1; the burst of Symbol0 of the length defined in bit field SYMBOL0_BURST_LEN is enabled */
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL3_LEN_POS                                                          (13U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL3_LEN_MASK                                                         (0x0000E000U)  /**< rw-Specifies the number of valid bits of the symbol definition of Symbol3. The range is from 1 bit (value 0000) to 8 bit (value 111) */
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL2_LEN_POS                                                          (10U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL2_LEN_MASK                                                         (0x00001C00U)  /**< rw-Specifies the number of valid bits of the symbol definition of Symbol2. The range is from 1 bit (value 0000) to 8bit (value 111) */
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL1_LEN_POS                                                          (5U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL1_LEN_MASK                                                         (0x000003E0U)  /**< rw-Specifies the number of valid bits of the symbol definition of Symbol1. The range is from 1 bit (value 0000) to 28 bit (value 11011) */
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL0_LEN_POS                                                          (0U)
#define TX_SYMBOL_CONFIG_RFU_TX_SYMBOL0_LEN_MASK                                                         (0x0000001FU)  /**< rw-Specifies the number of valid bits of the symbol definition of Symbol0. The range is from 1 bit (value 0000) to 28 bit (value 11011)*/

#define TX_SYMBOL0_DEF_RFU                                                                                0x3EU
#define TX_SYMBOL0_DEF_RFU_TX_SYMBOL0_DEF_POS                                                            (0U)
#define TX_SYMBOL0_DEF_RFU_TX_SYMBOL0_DEF_MASK                                                           (0x0FFFFFFFU)  /**< rw-Pattern definition for Symbol0*/

#define TX_SYMBOL1_DEF_RFU                                                                                0x3FU
#define TX_SYMBOL1_DEF_RFU_TX_SYMBOL1_DEF_POS                                                            (0U)
#define TX_SYMBOL1_DEF_RFU_TX_SYMBOL1_DEF_MASK                                                           (0x0FFFFFFFU)  /**< rw-Pattern definition for Symbol1 */

