Gloryfy/NFC/NfcdlibEx1_BasicDiscLoop_s32k118/NxpNfcRdLib/intfs/phhalHw_Ncx3330_Reg.h
#define TX_SYMBOL23_DEF_RFU                                                                               0x40U
#define TX_SYMBOL23_DEF_RFU_TX_SYMBOL3_DEF_POS                                                           (16U)
#define TX_SYMBOL23_DEF_RFU_TX_SYMBOL3_DEF_MASK                                                          (0x00FF0000U)  /**< rw-Pattern definition for Symbol3 */
#define TX_SYMBOL23_DEF_RFU_RESERVED_POS                                                                 (8U)
#define TX_SYMBOL23_DEF_RFU_RESERVED_MASK                                                                (0x0000FF00U)  /**< r--Reserved */
#define TX_SYMBOL23_DEF_RFU_TX_SYMBOL2_DEF_POS                                                           (0U)
#define TX_SYMBOL23_DEF_RFU_TX_SYMBOL2_DEF_MASK                                                          (0x000000FFU)  /**< rw-Pattern definition for Symbol2*/

#define TX_SYMBOL01_MOD_RFU                                                                               0x41U
#define TX_SYMBOL01_MOD_RFU_TX_S01_MODWIDTH_POS                                                          (16U)
#define TX_SYMBOL01_MOD_RFU_TX_S01_MODWIDTH_MASK                                                         (0x00FF0000U)  /**< rw-Specifies the length of a pulse for sending data of symbol 0/1. The length is given by the number of carrier clocks + 1. */
#define TX_SYMBOL01_MOD_RFU_RESERVED_POS                                                                 (9U)
#define TX_SYMBOL01_MOD_RFU_RESERVED_MASK                                                                (0x0000FE00U)  /**< r--Reserved */
#define TX_SYMBOL01_MOD_RFU_TX_S01_MILLER_ENABLE_POS                                                     (8U)
#define TX_SYMBOL01_MOD_RFU_TX_S01_MILLER_ENABLE_MASK                                                    (0x00000100U)  /**< rw-If set to 1; pulse modulation is applied according to modified miller coding. */
#define TX_SYMBOL01_MOD_RFU_TX_S01_INV_ENV_POS                                                           (7U)
#define TX_SYMBOL01_MOD_RFU_TX_S01_INV_ENV_MASK                                                          (0x00000080U)  /**< rw-If set to 1; the output envelope is inverted. */
#define TX_SYMBOL01_MOD_RFU_TX_S01_ENV_TYPE_POS                                                          (4U)
#define TX_SYMBOL01_MOD_RFU_TX_S01_ENV_TYPE_MASK                                                         (0x00000070U)  /**< rw-Specifies the type of envelope used for transmission of data packets. The selected envelope type is applied to the pseudo bit stream. 000b Direct output 001b Manchester code 010b Manchster code with subcarrier 011b BPSK 100b RZ (pulse of half bit length at beginning of second half of bit) 101b RZ (pulse of half bit length at beginning of bit) 110b Manchester tupple 111b RFU*/
#define TX_SYMBOL01_MOD_RFU_TX_S01_SC_FREQ_POS                                                           (3U)
#define TX_SYMBOL01_MOD_RFU_TX_S01_SC_FREQ_MASK                                                          (0x00000008U)  /**< rw-Specifies the frequency of the subcarrier. 0 424 kHz 1 848 kHz */
#define TX_SYMBOL01_MOD_RFU_TX_S01_BIT_FREQ_POS                                                          (0U)
#define TX_SYMBOL01_MOD_RFU_TX_S01_BIT_FREQ_MASK                                                         (0x00000007U)  /**< rw-Specifies the frequency of the bit-stream.  000b -> 1.695 MHz; 001b -> Reserved; 010b -> 26 kHz; 011b -> 53 kHz; 100b -> 106 kHz; 101b -> 212 kHz; 110b -> 424 kHz; 111b -> 848 kHz;*/

#define TX_SYMBOL23_MOD_RFU                                                                               0x42U
#define TX_SYMBOL23_MOD_RFU_RESERVED_POS                                                                 (9U)
#define TX_SYMBOL23_MOD_RFU_RESERVED_MASK                                                                (0x0000FE00U)  /**< r--Reserved */
#define TX_SYMBOL23_MOD_RFU_TX_S23_MILLER_ENABLE_POS                                                     (8U)
#define TX_SYMBOL23_MOD_RFU_TX_S23_MILLER_ENABLE_MASK                                                    (0x00000100U)  /**< rw-If set to 1, pulse modulation is applied according to modified miller coding.*/
#define TX_SYMBOL23_MOD_RFU_TX_S23_INV_ENV_POS                                                           (7U)
#define TX_SYMBOL23_MOD_RFU_TX_S23_INV_ENV_MASK                                                          (0x00000080U)  /**< rw-If set to 1, the output envelope is inverted.*/
#define TX_SYMBOL23_MOD_RFU_TX_S23_ENV_TYPE_POS                                                          (4U)
#define TX_SYMBOL23_MOD_RFU_TX_S23_ENV_TYPE_MASK                                                         (0x00000070U)  /**< rw-Specifies the type of envelope used for transmission of data packets. The selected envelope type is applied to the pseudo bit stream. 000b Direct output 001b Manchester code 010b Manchster code with subcarrier 011b BPSK 100b RZ (pulse of half bit length at beginning of second half of bit) 101b RZ (pulse of half bit length at beginning of bit) 110b Manchester tupple 111b RFU*/
#define TX_SYMBOL23_MOD_RFU_TX_S23_SC_FREQ_POS                                                           (3U)
#define TX_SYMBOL23_MOD_RFU_TX_S23_SC_FREQ_MASK                                                          (0x00000008U)  /**< rw-Specifies the frequency of the subcarrier. 0 424 kHz 1 848 kHz*/
#define TX_SYMBOL23_MOD_RFU_TX_S23_BIT_FREQ_POS                                                          (0U)
#define TX_SYMBOL23_MOD_RFU_TX_S23_BIT_FREQ_MASK                                                         (0x00000007U)  /**< rw-Specifies the frequency of the bit-stream.  000b -> 1.695 MHz; 001b -> Reserved; 010b -> 26 kHz; 011b -> 53 kHz; 100b -> 106 kHz; 101b -> 212 kHz; 110b -> 424 kHz; 111b -> 848 kHz;*/

#ifdef __cplusplus
} /* Extern C */
#endif

#endif /* PHHALHW_NCx3330_REG_H */
